[{"name":"Javier Gamarra","email":"javier.gamarra@liferay.com","avatar":"https://secure.gravatar.com/avatar/603c1c4f5d553aacc8abca66d6b00c7c?s=500","location":"Madrid, Spain","bio":"Developer always eager to learn and improve.\r\n\r\nI’m working as an Android developer at Liferay and I’ve worked in many development stacks: JS (angular, node…), Java EE, Scala or python. I am an organizer in [@cylicon_valley](http://www.meetup.com/es/Cylicon-Valley/), a tech meetup in Castilla y León, to help spread better technical practices in other companies.\r\n\r\nI love challenges and learning about **everything**.","twitter":"nhpatt","url":"http://nhpatt.com","organization":"Liferay","shirt_size":null,"title":"Two thousand katas later","abstract":"\"A kata is a programming exercise which helps programmers hone their skills through practice and repetition\"\n\nI've done 2000 of them in 7 languages, what have I learned? I'll talk about programming practices, language design and algorithm quizzes. And how they have shaped me to be a better developer","description":"\"A kata is a programming exercise which helps programmers hone their skills through practice and repetition\"\r\n\r\nI've done 2000 of them in 7 different languages, what have I learned? Am I really a better developer?\r\n\r\nI'll talk about programming practices, language design and algorithm quizzes after spending countless hours solving and reviewing katas. I've suffered doing performance optimizations in numeric sieves or dealing with verbose languages when a python one-liner would do the same job. I've also struggled with simple programming exercises in Elixir or Haskell...\r\n\r\nI think I've discovered a thing or two on how to be a better developer and I'm thrilled to share it. Don't miss this talk!","notes":"I could deliver the talk in English or Spanish. I'll be more than glad to answer any questions about the proposal :)\r\n\r\n","audience_level":"Intermediate","tag_list":["craftsmanship","performance","technical practices"],"rating":100.0},{"name":"Go Incremental","email":"ben@goincremental.com","avatar":"https://secure.gravatar.com/avatar/97d54fb1ca4c1fc4191aa26d1efbe7f3?s=500","location":"Burton on Trent ","bio":"I love my job. And my family. And sailing. And dogs.\r\n\r\nAnd Peppermint Tea. \r\n\r\n\r\n\r\n","twitter":"bwghughes","url":"https://www.goincremental.com","organization":"Go Incremental Limited","shirt_size":null,"title":"The Demise of Surprise - The 5 Phases of a Agile Transformation","abstract":"This talk is about the 5 phases of an agile transformation from the perspective of the coach - using emotion and specifically surprise to recognise the transitions through the transformation lifecycle.","description":"From quiet person at the back, straight on through The Heretic and finally out of to door, ruffled, ragged and emotionally drained, this talk walks through the emotional ups and downs of a committed coach, and how to use those emotional cues to navigate where you are in the agile transformation process.","notes":"I've run several successful agile transformations for global banks and retailers. I'm currently the Lead Coach,  EMEA for McKinsey Digital Labs - and have been a writer at InfoQ since 2007 on Agile and Transformations.\r\n\r\nI'm also a keen software developer - and a firm believer in being able to engage teams at all levels  - from pairing with developers to presenting financials to the board.","audience_level":"All","tag_list":["teams","psychology","business agility","agile management"],"rating":0.0},{"name":"Xavier Albaladejo","email":"xavi.albaladejo@gmail.com","avatar":"https://secure.gravatar.com/avatar/9206acb3bee48a98640009d85868587e?s=500","location":"Barcelona","bio":"Xavier Albaladejo es especialista en transformación organizativa basada en principios Agile-Lean.\r\nSu trabajo como Agile Expert en AXA EMEA-LATAM (Europe, Middle East, Africa \u0026 Latin America Region) consiste en la introducción de Agile como parte de la transformación Digital de los países de la Región, con el objetivo de incrementar su rapidez y flexibilidad para adaptarse a las necesidades de sus clientes. \r\nXavier Albaladejo es coordinador del Máster en Métodos ágiles de La Salle, Certified Scrum Practicioner, Certied LeSS Practitioner, fundador de proyectosagiles.org y de Agile Barcelona y ha sido presidente de Agile Spain.","twitter":"xavi_albaladejo","url":"https://www.linkedin.com/in/xavieralbaladejo","organization":"AXA EMEA-LATAM","shirt_size":null,"title":"Enterprise Agile - Cómo deconstruir tu organización paso a paso","abstract":"¿Estás en una gran transformación Agile? Pero “grande” (empresa o transformación) es sinónimo de “lento”. Te explicaremos cómo en AXA EMEA-LATAM (+ 25 países muy diferentes) estamos guiándoles en desecalar paso a paso para conseguir “agilidad de empresa”, más “customer centric” y ajustar su cultura.","description":"Agile es para conseguir clientes más satisfechos, para aportar más valor, pero de una manera especial, basada en personas y en sus interacciones, en su TRABAJO EN EQUIPO. Sin embargo, las grandes corporaciones se caracterizan por estar organizadas en departamentos bastante estancos (silos), con responsabilidades parciales y prioridades particulares (lo cual hace que los procesos se dilaten en el tiempo), creando distancia entre la concepción de un producto, su desarrollo y su operación, en lugar de ser organizaciones CUSTOMER CENTRIC.\r\n\r\nPor otro lado, para conseguir AGILIDAD ORGANIZATIVA, es importante ser PEQUEÑO. Este es otro de los factores clave si quieres reducir tu Time To Market y ganar flexibilidad para adaptarte rápidamente a las necesidades de sus clientes. Sin embargo, bien al contrario, las grandes corporaciones precisamente se caracterizan por su gran tamaño.\r\n\r\nSiendo conscientes de todo esto, en AXA EMEA-LATAM (región que incluye Europe, Middle East, Africa \u0026 Latin America [+ 25 países]) tenemos que añadir que estamos introduciendo Agile en entornos muy diversos simultáneamente: diferentes tamaños, organizaciones, culturas, productos, competidores, madurez de procesos, ... \r\n\r\nCon este contexto tan variado (pero con patrones comunes), donde los países nos preguntaban hacia dónde ir y cómo hacerlo, decidimos enfocar la transformación desde un punto de vista de “agilidad de empresa” y creamos un roadmap con objetivos y pasos razonables. Este guideline, sin ser prescriptivo, debía ayudar a que cada país pudiese diseñar su propio camino de agilización, en función de sus impedimentos específicos, así como permitirnos iniciar un diálogo con los Agile Champions de cada país y aportarles oportunidades de mejora.\r\n\r\nEn esta sesión te explicaremos cómo funciona este modelo de madurez Agile (que puede parecer contra-intuitivo para grandes transformaciones corporativas), el cual combina una adopción orgánica con ACCIONES DELIVERADAS para CONSCIENTEMENTE DECONSTRUIR una organización compleja y basarla en equipos de trabajo por iniciativas estratégicas de Negocio.\r\n\r\nPara ello nos basamos en desescalar la complejidad tanto como sea posible, influenciar comportamientos por medio de una nueva estructura organizativa, trabajar explícitamente la cultura (como enabler) y el Product Management (como resultado final), así como otros principios que explicaremos en la sesión.\r\n\r\nCreemos que esta sesión os dará ideas bastante interesantes sobre cómo llevar a cabo mejor vuestra propia transformación Agile :)\r\n","notes":"Dispongo ya de los slides preparados para la charla. Si es necesario, puedo remitir una copia para ayudar en su evaluación.","audience_level":"Advanced","tag_list":["scaling","culture","change management","rollout"],"rating":0.0},{"name":"Jose Ramón","email":"joseramon.diaz@agilar.org","avatar":"https://secure.gravatar.com/avatar/69fcb4d6ccff6e08683a3a4e23a16b2d?s=500","location":"San Sebastian - Bruselas","bio":"Software development consultant and Agile Coach. \r\nOpen Space facilitator.\r\n\r\nWorking and playing in software industry since 1999. At present, helping people and organisations to improve their knowledge and use of Agile Methodologies, and to share Agile mindset in Agilar.\r\n\r\nSoftware engineering (Basque Country University - 1999), Master in Bussines Administration (UNED - 2005) and Certified Scrum Professional (CSP).\r\n\r\nFounding member of Spanish agile association “Agile-Spain” and an active member of spanish comunity, helping to organizate conferences and local meetings. Also, frequent speaker at spanish conferences about agile.\r\n\r\nAbout technical development, he has been working with Java for enterprise platforms for several years. Last years, learning Ruby on Rails for other web development.\r\n\r\nHis first contact with Agile was as a team leader who wanted to improve his team. Scrum was the first trial, and later he was working with Extreme Programming development techniques and Agile/Lean mindset.\r\n\r\nCurrently helping companies to improve their Mondays.","twitter":"joserra_diaz","url":"","organization":"Agilar","shirt_size":null,"title":"Las dependencias matarán tu transformación","abstract":"Durante la transformación digital de una gran empresa, podemos observar cómo a nivel técnico se producen muchas batallas: las dependencias. Dependencias a nivel técnico, entre equipos de diferentes culturas durante el proceso de transformación, podrían anular las ventajas de los nuevos modelos.","description":"Nuestras arquitecturas de software reflejan las estructuras de comunicación de la organización que las produce, según la Ley de Conway. ¿qué impacto tiene esto durante una transformación, donde las estructuras cambian, y las culturas se enfrentan? En esta breve charla expondremos el problema, y las razones por las que vigilar esos pequeños campos de batalla muy de cerca.","notes":"Trato de explicar mi visión sobre el problema concreto, tal y como lo he apreciado trabajando en el BNPParibasFortis (banco belga) durante un año.","audience_level":"Intermediate","tag_list":["culture","agile architecture","change management","scaling","teams"],"rating":100.0},{"name":"Pablo Garaizar Sagarminaga","email":"garaizar@deusto.es","avatar":"https://secure.gravatar.com/avatar/8d1321adaec4b59e596790e1b36b719f?s=500","location":"Bilbao","bio":"Doctor en Informática y Licenciado en Psicología. Investigo sobre TIC y Educación en Deusto Learning (http://dtlearning.deusto.es/) y sobre aprendizaje asociativo en Labpsico (http://labpsico.deusto.es). Atesoro bastante conocimiento curioso-pero-inútil, pero realmente no sé mucho de nada O:)","twitter":"PGaraizar","url":"http://paginaspersonales.deusto.es/garaizar","organization":"Universidad de Deusto","shirt_size":null,"title":"Neurobollocks: the new snake oil / Neuromandangas: el nuevo aceite de serpiente","abstract":"Los avances en neurociencia han motivado mestizajes audaces (neuropolítica, neuromarketing, neuroeducación). Sin embargo, muchos de ellos se basan en una deficiente comunicación entre neurocientíficos y profesionales. Nuestro objetivo es valorarlos a la luz de la evidencia científica disponible.","description":"Lo \"neuro\" está de moda. Los recientes avances en neurociencia han insuflado tanto optimismo en otras disciplinas que todas ellas quieren participar de la fiesta: neuroeducación, neuromarketing, neuropolítica, neuroeconomía... Hemos pasado del \"todo es mejor con Bluetooth\" al \"todo es mejor con una imagen del cerebro tomada por resonancia magnética funcional\". Sin embargo, de la misma forma que los hallazgos en física cuántica no son directamente aprovechables para el deporte, muchos de los descubrimientos neurocientíficos están lejos de ser de aplicación directa en todas esas disciplinas con las que se pretende converger.\r\n\r\nA pesar del interés que despierta la neurociencia en ámbitos muy variados, la comunicación de sus hallazgos es muy definciente. Esto provoca que sean muchos los neuromitos que persisten y muchas las teorías no probadas que se asumen como ciertas (estilos de aprendizaje, inteligencias múltiples, paisajes de aprendizaje, etc.). Esta charla pretende pinchar el globo de lo \"neuro\", repasando qué sabemos que funciona y qué propuestas no han demostrado su validez. Un jarro de agua fría en clave de humor para entusiastas de las neuromandangas, sin intención de sentar cátedra pero sí de provocar debate.","notes":"Investigo sobre estos temas con Marta Ferrero y Miguel Ángel Vadillo, doctores en Psicología y expertos en aprendizaje. Me gustaría poder liar a alguno de los dos para que participen en la charla.","audience_level":"All","tag_list":["neuromyths","education","neuroscience","psychology"],"rating":100.0},{"name":"Pablo Domingo","email":"pdomingod@gmail.com","avatar":"https://secure.gravatar.com/avatar/fd6306b452e769334b1b3c9376a8321c?s=500","location":"Unknown","bio":"\r\nHe describes himself as someone who is always seeking for mastery on agile, lean, kanban, scrum and personal development. Furthermore, he is a tireless reader, skier, snowboarder and guitar player.\r\n\r\nAfter studying Software Engineering in Zaragoza, Pablo soon left his city and moved to Madrid where he mainly developed his career at Airbus as software engineer, and agile coach. He initiated the agile transition of the on-ground systems software organization in 2010 and took part of most important Airbus’ Lean and Agile initiatives in Europe.\r\n\r\nSince 2012 Pablo has been cross-training on agile, scrum, Lean and software development practices like Behavior Driven Development. In 2014, he has started writing a blog BecomingAgile which covers new learnings and practices from Lean, Agile, leadership, coaching and software development.\r\n\r\nHe has been working as agile coach and scrum master at King for 2 years. He cares of encouraging the agile values of the company while helping build a learning organization. He currently lives in Barcelona with his partner Maria, two lovely kids and his dog.","twitter":"pavleras","url":"http://becomingagile.wordpress.com","organization":"","shirt_size":null,"title":"Play4Learning - Agile ","abstract":"¿Es posible escapar de un templo inca con el tesoro a través de los principios ágiles?\n¿Refinar mejor nuestro producto analizando escenarios de un crimen?\n¿Es posible aprender sobre liderazgo de equipos mientras se hunde el suelo a nuestros pies?\n\n","description":"¿Es posible escapar de un templo inca con el tesoro a través de los principios ágiles? \r\n¿podemos entrenar el pensamiento lateral lanzando dados? \r\n¿Refinar mejor nuestro producto analizando escenarios de un crimen? \r\n¿Está Gotham preparada para la continua adaptación a los cambios? \r\n¿Es posible aprender sobre liderazgo de equipos o deuda técnica mientras se hunde el suelo a nuestros pies?\r\n\r\nEsta charla taller de 2 horas de duración tiene por objetivo, aprender algunas de las características esenciales de las metodologías ágiles, explorar dinámicas de equipo y desarrollar habilidades cognitivas como el pensamiento lateral o la creatividad ***jugando*** a juegos de mesa. Los asistentes van a aprender de forma inovadora nuevos conceptos y técnicas que permitan ***introducir*** en sus organizaciones al mismo tiempo que se divierten y mucho, jugando.","notes":"#Description\r\nEl workshop debería de tener un límite máximo de 50 personas y se ejecutarían en grupos de 10-15 personas. \r\n3 facilitadores por el momento me acompañarán en este proyecto:\r\n\r\n\t1. Jaume Jornet \r\n\t2. Israel Alcazar \r\n\t3. Maria Belén Serna\r\n\t4. ?\r\n\r\nVoy a hacer un pequeño repaso de cada uno de los juegos y algunos aprendizajes extraídos de cada uno de ellos para que os hagáis una idea del contenido y desarrollo de la sesión.\r\n\r\n# Black Stories (NIVEL BÁSICO)\r\n\r\nBlack stories es un juego de cartas en el que los jugadores son un grupo de investigadores que deben de averiguar las causas que han provado extrañas muertes utilizando técnicas de creatividad y pensamiento lateral.\r\nEs un juego de duración corta, no más de 8-10 minutos aunque esto depende de la habilidad del facilitador para proporcionar pistas al grupo cuando este, no está encaminado.\r\n\r\n## How It Works \r\n\r\nEl game master selecciona una de las 50 cartas del juego. En esa carta se presenta una breve descripción del escenario del crimen mientras que en la parte posterior se describen con mayor lujo de detalles las causas o motivos que lo han provocado.\r\nEl game master lee ambas caras para sí mismo y después lee en voz alta a los investigadores la descripción breve del escenario del crimen.\r\n\r\n\u003e El objetivo del juego es que los investigadores encuentren las causas/motivos que han provocado la muerte a través de preguntas al game master.\r\n\r\nEl game master solo puede responder a las preguntas con Si o No. \r\nAquí no hay un número limitado de jugadores por los que podemos hacer la dinámica con cualquier distribución.\r\n\r\n## Learning  \r\n\r\n### Lateral thinking \u0026 Problem Solving\r\nLa practica habitual de este juego  ayuda a desarrollar capacidades de [pensamiento lateral] [lateral-thinking], ya que los jugadores:\r\n\t* Rompen los patrones de pensamiento habitual.\r\n\t* Se focalizan en \"pruebas\" y a partir de ahí amplian con nuevas ideas.\r\n\t* Se posicionan en diferentes perspectivas.\r\n\r\n### Engagement\r\nDespués de haber probado con varios equipos en contextos muy diferentes, hemos observado una mejor disposición y ánimo a participar en reuniones de planificación o refinamiento del producto.\r\n\r\n## When to use it?\r\nEste tipo de juegos rápidos son un buen punto de partida en reuniones de planificación de producto y refinements. También lo hemos probado en retrospectivas o ice breakers para brain stormings.\r\n\r\n# Story Cubes (NIVEL BÁSICO)\r\nEs un juego tan simple como tirar los dados e inventar una historia con las imágenes que han salido.\r\n\r\n## How It Works \r\nSe realizan diferentes tipos de juegos para explotar la creatividad:\r\n\r\n1. **Warm-up**\r\nCrear una historia con las 3 fases: introducción, desarrollo y desenlace en la que participan todos los integrantes de la mesa y cada uno desarrolla la historia sobre la anterior. \r\n\r\n2. **Retrospective**\r\n¿Como ha ido el sprint? ¿Cómo ha sido la conferencia hasta el momento?  \r\n\r\n3. **Cada superheroe necesita un superpoder**\r\nLanzamos 3 dados que nos determinarán que tipo de super poder tenemos.\r\nLanzamos los 9 dados para crear la historia que nos ha llevado a convertirnos en super heroes.\r\n\r\n4. **Cada superheroe necesita un supervillano**\r\nLanzamos 9 dados y en **grupo** creamos el supervillano; poder, modus operandi, nombre.\r\n\r\nExisten muchos más modos de juego en la web oficial de [Story cubes ][story-cubes].\r\n\r\n## Learnings\r\n\r\n### Creativity\r\nEs un juego por excelencia para el desarrollo de la creatividad. La creación de ideas a partir de [tecnicas de provocacion][provocation-technique] como son la exageración o distorsión.\r\n\r\nAdemás, la práctica habitual mejora la capacidad cognitiva a través de la creación de nuevos caminos y asociaciones.\r\n\r\n## When to use it?\r\nEste tipo de juegos rápidos son válidos en culaquier momento.\r\nEn retrospectivas para reinventar la historia del último sprint / iteración.\r\nIce breaker en reuniones.\r\nWarm-up en brainstormings.\r\n\r\n\r\n# The Escape (NIVEL BÁSICO-MEDIO)\r\nEste juego colaborativo de hasta 6 personas nos pone el sombrero y látigo de Indiana Jones y nos adentra en un templo maya. El objetivo de este frenético juego es salir del templo con el mayor número de gemas y con todos los aventureros con vida antes de 10 minutos.\r\n\r\n## How It Works \r\nLos aventureros se enfrentan a un templo del que solo conocen la puerta de entrada y que van descubriendo conforme avanzan por las catacumbas buscando gemas. En su incursión se enfrentarán a multitud de peligros; hechizos, trampas, que dificultarán y mucho la consecución de su objetivo.\r\n\r\n## Learnings\r\nRealizamos varias variaciones con respecto al juego original en algunas rondas (iteraciones de 10 minutos) para ayudar al aprendizaje de alguno de los conceptos ágiles.\r\n\r\n### Estimation\r\n**VARIACIÓN** Pedimos al equipo que estime la cantidad de gemas que van a traer de vuelta antes de comenzar a explorar el templo. Las diferencias entre lo estimado y obtenido nos permiten explorar las creencias sobre el modelo de estimaciones y preesentar alternativas cómo utilizar datos históricos con [Montecarlo][montecarlo-cas2k15].\r\n\r\n### Variability\r\nTodos los problemas a lo que se enfrentan los jugadores (hechizos, bloqueos, trampas) son fácilmente asignable a distintas fuentes de variabilidad (negocio, personas, tecnología) y que afectan a todo el sistema o solo a determinadas partes  (common cause, special cause) por lo que es un buen momento para explicar y reflexionar sobre los tipos de variabilidad a los que se enfrentan las organizaciones y que medidas se pueden poner en marcha para minimizar su impacto.\r\n\r\n\r\n### Technical Debt\r\nHay un momento en el juego en el que es muy posible que los exploradores se encuentren bloqueados y no puedan continuar por lo que deben de pagar con las gemas que han ido recuperando para poder recuperar su capacidad de acción. Si esto sucede (algo muy habitual) podemos traducirlo al concepto de deuda técnica y los efectos que tiene en el desarrollo de nuestros productos y/o proyectos.\r\n\r\n### Responding to change over following a plan\r\n**VARIACIÓN** El juego permite **mostrar parte o el total** del templo antes de comenzar e invitamos a los grupos a definir la **estrategia** que van a utilizar durante el juego. Esta falsa sensación de control [no valdrá de mucho][planning-is-useless] ya que la variabilidad afectará desde muy temprano en el juego. \r\nEsto nos permite explorar el cómo las organizaciones se enfrentan a la incertidumbre:\r\n\r\n\t\t* Cliente: tipos de contratos ágiles y cómo se gestiona el riesgo.\r\n\t\t* Plan: la sensación de trocear en elementos más pequeños un problema complejo nos da la [sensación de contol][lean-change-management]\r\n\t\t* Sistema: aprender sobre la falacia del pensamiento lineal y trabajar el pensamiento sistémico y experimental. [cynefin] [cynefin-model]. \r\n\r\n### Transparency, Visual management \u0026 Decision Making\r\nEn este juego de mesa disponemos de un tablero que nos proporciona información valiosa sobre la situación de los exploradores y nos ayuda a tomar las decisiones que nos acerquen al objetivo.  \r\n\t\r\n\t* ¿Como tomamos decisiones en nuestra organizacion?\r\n\t* ¿Que variables necesitamos para tomar decisiones?\r\n\t* Disponemos de un tablero de nuestros productos o proyectos? \r\n\t* ¿Representa la situación real? ¿Es útil?\r\n\t* ¿Con que frecuencia representamos esta información?\r\n\r\n# The Forbidden Island (NIVEL MEDIO-AVANZADO)\r\n\r\nThe forbidden island es un juego colaborativo de hasta 4 personas cuyo objetivo es rescatar 4 tesoros de la isla antes de que esta se hunda y salir todos ellos con vida en helicoptero. \r\n\r\n## How It Works \r\n\r\nLos jugadores tienen un número limitado de acciones en las que se intercambian cartas de tesoro, paralizan temporalmente el hundimiento de algunas zonas de la isla y utilizan capacidades especiales de cada personaje con el fin de ayudar al grupo a conseguir el objetivo.\r\n\r\n## Learning \r\n\r\n### Customer focus\r\n\r\n#### Flow efficiency vs Resource efficiency. \r\n\r\nEn este juego es más importante focalizarse en el objetivo de coger el tesoro, y mantener a salvo la pista de aterrizaje que gastar el número de acciones disponibles de cada jugador en cada ronda.\r\n\r\nQueremos presentar la idea de matriz de eficiencia de [This is Lean][This-is-lean] y abrir la \r\nconversación en la mesa a dónde se situan las distintas organizaciones. \r\n\r\n#### WIP Limits\r\nEl trabajo de [Donald Reinertsen][flow] también tiene espacio ya que al disponer de un número limitado de acciones por cada jugador nos permite enlazar con la queuing theory, y el efecto en nuestro development/lead/cycle time de la [eficicencia de recursos] [resource-efficiency]. \r\n\r\n#### Landing point\r\nEl esfuerzo constante por mantener a salvo la pista de aterriza tiene una asociación directa a deuda técnica, su impacto en el cliente y el equilibrio entre entrega de valor y mantenibilidad.  \r\n\r\n### Organization\r\nAl tratarse de un juego colaborativo también se pueden extraer muchos aprendizajes sobre las dinámicas de equipo y el efecto de asignar objetivos a nivel individual.\r\n\r\n#### Collaboration  \r\n\r\nEs un juego colaborativo y cooperativo por lo que existe un único objetivo que dista mucho de lo que nos encontramos en las organizaciones de hoy en día. Nos gustaría arrojar luz en los problemas que acarrean las políticas de objetivos individuales, performance appraisal y retos a alternativas más cooperativas.\r\n\r\n#### Leadership\r\n\r\nEs un juego de colaboración constante por lo que se observa fácilmente los roles que toman los distintos personajes durante el juego. El modelo de liderazgo de [Goleman][leadership-goleman] permite reflexionar sobre quien, que y cúando es más apropiado un modo u otro durante la partida.\r\n\r\n#### Responding to change over following a plan\r\nEste juego a diferencia de Escape **muestra el total de la isla** que se va hundiendo por cada ronda con lo que nuestra estrategia inicial[no valdrá de mucho][planning-is-useless]. \r\nEsto nos permite explorar el cómo las organizaciones se enfrentan a la incertidumbre:\r\n\r\n\t\t* Cliente: tipos de contratos ágiles y cómo se gestiona el riesgo.\r\n\t\t* Plan: la sensación de trocear en elementos más pequeños un problema complejo nos da la [sensación de contol][lean-change-management]\r\n\t\t* Sistema: aprender sobre la falacia del pensamiento lineal y trabajar el pensamiento sistémico y experimental. [cynefin] [cynefin-model]. \r\n\r\n### Transparency \u0026 Decision Making\r\nEn este juego de mesa disponemos de un tablero que nos proporciona mucha de la información necesaria para la toma de decisiones y ayude al grupo a la consecución de nuestro objetivo: \r\n\t\r\n\t* ¿Como tomamos decisiones en nuestra organizacion?\r\n\t* ¿Que variables necesitamos para tomar decisiones?\r\n\t* ¿Cómo representamos esa información para la toma de decisiones?\r\n\t* ¿Con que frecuencia representamos esta información?\r\n\r\n# Scrum Cards (BASICO)\r\n\r\nSrum cards es un juego de cartas que permite al jugador experimentar en sprints la esencia de Plan, Do and reflect del framework de Scrum. Esta experiencia facilita el aprendizaje y permite a los participantes prepararse para el uso real de Scrum. \r\n\r\n## How It Works \r\nA través de 3 sprints de 3 días los jugadores simulan cómo trabajar en el framework Scrum. \r\n1. Los jugadores del equipo determinan su pronóstico de entrega del sprint backlog.\r\n2. Ejecutan el backlog y van progresando conforme el resultado de los dados \r\n3. Roban cartas que disparan eventos de variabilidad o solución.\r\n4. Evaluación y aprendizaje durante la retrospectiva.\r\n\r\n## Learning \r\n\r\n### Scrum Basics\r\nEste juego permite experimentar la planificación y priorización, ejecución y retrospectiva de Scrum.   \r\n\r\n### Discussions\r\nEste juego saca a la luz diferentes problemas que diariamente sufren los integrantes de los equipos y las  sobre   \r\n\r\n### Variability \u0026 Events\r\nExisten 3 cartas especiales: \r\n1. Event: cambian la estructura del equipo o introducen situaciones inesperadas dentro del sprint.\r\n2. Problem: bloquean el progreso de las historias de usuario \r\n3. Solution: introducen ideas para la discusión de organización de los equipos. No todas las cartas de solución son aplicables a todos los problemas pero generan discusiones muy interesantes.\r\n\r\n### Estimation \r\nEl equipo durante el primer sprint estima la cantidad de puntos que es capaz de entregar al final del sprint y exploramos las creencias sobre el modelo de estimaciones. En sprints posteriores presentamos alternativas a utilizar cómo velocidad o [Montecarlo][montecarlo-cas2k15].\r\n \r\n### Risks\r\nIdentificando y categorizando las cartas de problemas que han aparecido durante los 3 sprint podemos hacernos una idea de los probelmas habituales a los que se enfrentan los equipos y preparar estrategias que ayuden a minimizar el impacto.\r\n\r\n# Rewards \u0026 Gamification\r\nPara llevar a cabo este workshop con tanta gente necesitamos adquirir 4/5 unidades del juego Escape,  4/5 unidades del juego Story Cubes y/o 4/5 unidades del juego The Forbidden Island por lo que necesitaría de la financiación por parte de Agile spain. \r\nCon el fin de que estos juegos no caigan en un cajón y hagan su labor educativa he pensado en gamificar estos premios. \r\n\r\nYa hemos hecho una prueba de concepto con 30 personas en [MeetUp][Agile-bcn] con un resultado de 4,5 sobre 5. Haríamos posiblemente otra edición más en por lo que estará bastante rodado para el mes de Diciembre.\r\n\r\n## Merit Money\r\nDespués de cada una de las rondas del juego Escape vamos a entregar 3 gemas a cada uno de los miembros del equipo para que se las repartan entre los integrantes del equipo de acuerdo a los parámetros que consideren importantes; nivel de cooperación, liderazgo, etc. Posteriomente, durante el aprendizaje y discusión, el facilitador también dispondrá de 3 monedas que entregará a las personas de la mesa que participen con las observaciones y preguntas más valiosas.\r\n\r\nPor supuesto, la última discusión relacionada con [Merit money][merit-money] estaría relacionada con la evaluación individual de los objetivos, sus efectos en las organizaciones y el planteamiento de formas alternativas.\r\n\r\nJusto al final explicaremos el uso de estas monedas y a las 2/3 personas con mayor número de gemas elegirá que juego se quiere llevar a casa hasta entregar los 2 o 3 juegos de los que constará el workshop.\r\n\r\n[Agile-bcn]: http://www.meetup.com/Agile-Barcelona-Meetup/events/231044095/\r\n[this-is-lean]: https://www.amazon.es/This-Lean-Niklas-Modig/dp/919803930X/ref=sr_1_1?ie=UTF8\u0026qid=1464862611\u0026sr=8-1\u0026keywords=this+is+lean\r\n[Flow]: https://www.amazon.es/Principles-Product-Development-Flow-Generation-ebook/dp/B00K7OWG7O/ref=sr_1_sc_1?ie=UTF8\u0026qid=1464862909\u0026sr=8-1-spell\u0026keywords=donald+reinertse\r\n[resource-efficiency]: https://connected-knowledge.com/2012/05/10/the-elusive-20-time/\r\n[lateral-thinking]: https://www.amazon.es/Lateral-Thinking-Creativity-Step-ebook/dp/B003V1WTLI/ref=sr_1_1?ie=UTF8\u0026qid=1464863438\u0026sr=8-1\u0026keywords=de+bono+lateral+thinking\r\n[planning-is-useless]: http://www.brainyquote.com/quotes/quotes/d/dwightdei164720.html\r\n[cynefin-model]: http://www.everydaykanban.com/2013/09/29/understanding-the-cynefin-framework/\r\n[story-cubes]: https://s3-eu-west-1.amazonaws.com/storycubes-website/plays/instructions/15/original/RSC_Mix.pdf?1394732556\r\n[montecarlo-cas2k15]: http://www.slideshare.net/Pavleras/how-to-bet-in-montecarlo-and-end-up-with-some-money-in-your-pocket?qid=42f4054f-cf0f-4cd3-b898-0db748f04642\u0026v=\u0026b=\u0026from_search=1\r\n[scrum-card-game]: http://tim.com.ua/scrum-card-game/\r\n[provocation-technique]: https://en.wikipedia.org/wiki/Po_(lateral_thinking)\r\n[lean-change-management]: https://www.amazon.es/Lean-Change-Management-Innovative-organizational-ebook/dp/B00O580KUI/ref=sr_1_1?ie=UTF8\u0026qid=1465974310\u0026sr=8-1\u0026keywords=lean+change+management\r\n[merit-money]: https://management30.com/product/workouts/merit-money-bonus-systems/\r\n[leadership-goleman]: http://www.danielgoleman.info/topics/leadership/\r\n\r\n# Why me?\r\nSoy un apasionado de las metodologías ágiles y me encantan juegos de mesa así que este año decidí empezar experimentar con equipos la mezcla entre ambos y creo que ha salido un workshop muy interesante.  Además, año tras año me siento en deuda con la comunidad y este creo que va a ser una forma especial y muy divertida de devolver lo mucho que he aprendido en estos últimos años mediante \"juegos\". Todas las experiencias que hemos tenido han ayudado a organizaciones  a interiorizar y vivir los aprendizajes de agilidad y dinámicas de equipo de forma diferente.\r\n\r\n","audience_level":"All","tag_list":["scrum","kanban","gamificacion","teams","games"],"rating":0.0},{"name":"Carlos Blé","email":"ble.jurado@gmail.com","avatar":"https://secure.gravatar.com/avatar/7682355fddfd0f336bb2d6364d3689e4?s=500","location":"Unknown","bio":"Director de Codesai.com. Apasionado de las computadoras desde los 6 años y viviendo de ello desde 2001. Carlos ha sido consultor independiente desde 2009, ayudando a decenas de equipos y organizaciones por toda España. También imparte formación en Alemania, Inglaterra, Belgica y Francia. Desde 2001 a 2009 trabajó en diversas empresas incluyendo sus propias startups. Es autor del primer libro en castellano sobre Test Driven Development (TDD). Es desarrollador fullstack y los lenguajes que maneja habitualmente son JavaScript, C#, Java and Python.\r\n\r\nReside en Tenerife. Tiene un pequeño refugio para gatos, es vegano y horticultor aprendiz, en transicion hacia un estilo de vida sostenible para el planeta.","twitter":"carlosble","url":"http://www.carlosble.com","organization":"Director de Codesai","shirt_size":null,"title":"Aprender a distinguir el problema de las soluciones","abstract":"El título de esta charla tiene doble sentido. Confundimos la solución con el problema contínuamente perdiendo la oportunidad de encontrar mejores soluciones. Separar el \"Qué\" del \"Cómo\" es clave en el análisis. Técnicas como Specification by Example, BDD, Mind maps... pueden ayudarnos.","description":"Uno de los motivos por los que más se desperdicia código, tiempo y dinero, es que confundimos la solución con el problema. No entendemos bien el problema del usuario y erramos en la toma de requisitos. Esto nos produce la sensación de que el cliente está todo el tiempo cambiando de opinión y de requisitos pero en la mayoría de los casos no es verdad. Es la comunicación la que falla. Es normal porque estamos entrenados para buscar soluciones, los desarrolladores somos solucionólogos. Cuando nos decantamos por una solución concreta estamos descartando las demás. Si hay otras más sencillas y convenientes para resolver el mismo problema, no nos daremos cuenta nunca, o quizás cuando ya sea demasiado tarde y hayamos dado demasiadas vueltas. En esta sesión hablaremos de separar el \"Qué\" del \"Cómo\" para ser eficaces y económicos resolviendo problemas, sin que la calidad de las soluciones se vea afectada.","notes":"","audience_level":"All","tag_list":["design thinking","customer centric","inceptions","lean startup","product design","product discovery","storytelling \u0026 storydoing"],"rating":100.0},{"name":"Amalia Hernandez","email":"amaliahern@gmail.com","avatar":"https://secure.gravatar.com/avatar/f1ce22f8cf8faadfd7482e58999ac056?s=500","location":"Unknown","bio":"","twitter":"amaliahern","url":"","organization":"Cognizant","shirt_size":"Women's S","title":"Hacer Agile o Ser Agile","abstract":"En el mundo Agile existen casos de éxito y de fracaso que me llevan a plantear cuestiones como: ¿Cuál es el proceso de aprendizaje de Scrum? ¿Hay unas directrices a seguir? ¿Te defines como practicante o creyente?","description":"El comienzo de la historia es de sobra conocido: Empresa grande que se ha subido al carro del agilismo. Los equipos han empezado a utilizar Scrum pero el rendimiento no es el esperado. Esta es la excusa que me ha llevado a pensar ¿Cuál es el proceso de aprendizaje de Scrum? ¿Hay unas directrices a seguir dentro del mundo del agilismo? ¿Te defines como practicante o creyente?","notes":"","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Gerard Chiva","email":"gerard.chiva@gmail.com","avatar":"https://secure.gravatar.com/avatar/84c6426ef9ef04fd75f6a1fcfb540da7?s=500","location":"Unknown","bio":"Freelance Lean \u0026 Agile Coach, Team Coach and Business Consultant\r\nCertified ICF Coach\r\n\r\nI make things happen","twitter":"GerardChiva","url":"http://gerardchiva.com","organization":"","shirt_size":"Men's L","title":"Solution Focus Coaching - A positive approach to change","abstract":"Achieve positive and sustainable change by focusing in the future and the present, not in the past.\n\nWe will see differences between a problem focus approach and a solution focus approach, we will understand the principles behind positive change, tools, techniques and real world examples.","description":"As coaches, consultants, managers or engineers we have a tendency to fix problems by trying to understand what caused them, the root cause. Focusing on the problem.\r\n\r\nProblem focus is grounded in engineering and traditional psychotherapy models for fixing machines, processes or people. It works, specially for processes and systems, and there exist very powerful techniques like 5 WHYs, Ishikawa, Causal-Loop Diagrams in order to understand root cause.\r\n\r\nBut, when we go into the domains of humans latest advances in working with individuals and groups have demonstrated that a positive approach to change, a focus on solutions, works much better than a problem-focus approach.\r\n\r\nFrom Positive Psychology, Brief Therapy and Solution Focus Coaching we have 3 different approaches to working with people in creating positive and durable change.\r\n\r\nIn this talk we will see differences between a problem focus approach and a solution focus approach, we will understand the principles behind positive change, tools, techniques and real world examples that you can apply as Agile Coach, Manager or Team Member.","notes":"","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Joke Vandemaele \u0026 Xavier Quesada-Allue","email":"joke.vandemaele@agilar.org","avatar":"https://secure.gravatar.com/avatar/4ba4b6baa718a3412b5737df397dc658?s=500","location":"Gent, Belgium","bio":"Joke Vandemaele\r\nAgile Coach and experienced Product Owner with an MBA in Marketing Management. In the last years she has coached multiple teams at the Belgian Post and Proximus (ex Belgacom) while doing double duty as an 'agile mom'. She is currently Agile Coach at Tower Automotive and Johnson Controls, both located in the harbour of Gent in Belgium, introducing Scrum beyond Sofware in the automobile sector.  \r\n\r\nXavier Quesada Allue\r\nConsultant, coach, trainer and author, specializing in applying Lean-Agile-Scrum methods to create high performance, continuously improving teams and organizations. Certified Enterprise Coach \u0026 Trainer and author of the Visual Management Blog. Community leader and frequent international conference speaker, passionate about promoting lean and agile methodologies as a more productive and more sustainable way of working. Founder of Agilar.    ","twitter":"","url":"http://www.agilar.com","organization":"Agilar","shirt_size":"Men's L","title":"Patterns in Scrum beyond software","abstract":"Summary of the patterns and challenges we have found in two years of experimenting with the application of Scrum, Kanban and Visual Management outside of software. We will cover case studies in automotive continuous improvement teams, factory maintenance, and general administrative work.","description":"Summary of the patterns and challenges we have found in two years of experimenting with the application of Scrum, Kanban and Visual Management outside of the software product development domain. \r\n\r\nWe will cover case studies in automotive continuous improvement teams, factory maintenance, and general administrative work.\r\n\r\nWe will share: \r\n- How teams are composed and the differences in the role of the Product Owner. \r\n- What types of work we have identified and how we prioritize it. \r\n- Which events and artifacts of Scrum can be applied for these different types of work and teams.\r\n- A modular model for building custom taskboards.","notes":"This is the evolution of the work we spoke about at the CAS and ATBru in 2014: Scrum in Manufacturing - Agile beyond software.\r\nFormat: presentation with pictures of taskboards from real case studies. ","audience_level":"Intermediate","tag_list":["scrum","non-software","multidisciplinary teams","teams","agile management"],"rating":0.0},{"name":"Juan Antonio Sosa Cantero","email":"juanan.sosa@gmail.com","avatar":"https://secure.gravatar.com/avatar/e739a84fdf7777109a471d3bb7d252f7?s=500","location":"Unknown","bio":"Engineer in Computer Management from the FIB (UPC) with more  than 13 years of experience. I have been working as developer, analyst, software architect, project manager, Scrum Master and Team Lead, almost always in environments with . NET technology. Fan of agile  development methodologies and project management, I have performed tasks of mentoring  and coaching of project management methodologies with Scrum (I’m Certified Scrum Master by  the Scrum Alliance) as well as development techniques (Test Driven Development , Continuous  Integration, Configuration Management ...) in different companies where I worked. Actively  involved in agile communities of Spain and Catalonia, organising and promoting events to  spread the knowledge about Agile Methodologies. \r\n\r\nIn my free time I like reading, listening and play music , doing sports and learn  more about   software development (technologies, languages...)","twitter":"Juanan_Sosa","url":"","organization":"typeform.com","shirt_size":"Men's S","title":"3000 coffees, 750 plants and 1 mamon","abstract":"What can I do as a company to foster a better culture? To improve team's productivity? To engage innovation? To make people happier?\n\nWe will explain why and how we do at Typeform, using an approach based on people driving the business and what is the impact in our product and customers. \n\n","description":"People spend around 30% of their lives working. Our work provides us money, but also  provides us social status, provides us colleagues, friends, relationships… and at the end provides us  an identity.\r\n\r\nSo it’s clear that work has become a central and a very important part for everyone life, and as more raises this importance more the clear is the need for people to be motivated and happy at work.\r\n\r\nThere are a lot of “noise” lately with this issue about motivate people and make them “happy”: Team building events, nicer offices, collaboration, communication… It seems that as happier the people is at work, the better the performance of the workers and the better the results for the company. But... is this true? Applies this necessity also to the employer? Why do they need to invest in motivate people? What they win at the end?\r\n\r\nHere at Typeform we believe that it is, and we are always looking for new ways to push the envelope. We would like to give our point of view and some examples about what do we do in order to motivate people and what is the impact in our product, in our customers and in the results of the company in the end. \r\n\r\nAlso we will explain you some of the challenges that we have, specially related to the big growth that the company has experienced in the last months. ","notes":"The presentation will be done by myself with the help of Dino Zafirakis","audience_level":"All","tag_list":[],"rating":100.0},{"name":"Vanesa Tejada","email":"vanesa.tejada.munoz@gmail.com","avatar":"https://secure.gravatar.com/avatar/59ebed21af3962333aa19f8ac1f5f86b?s=500","location":"Madrid • Spain","bio":"Trabajo como Programme Owner y facilitadora de la comunidad de Product Owners en lastminute.com group, una de las mayores OTA de Europa. Disfruto impulsando valores y prácticas Agile-Lean así como buenos hábitos de trabajo, con el fin de mejorar el flujo de desarrollo de productos, rendimiento de los equipos, y la productividad personal. Me gusta hacer las cosas de una forma más simple. Comparto mis valores y experiencias en vanesatejada.com.","twitter":"vanesa_tejada","url":"https://vanesatejada.com/","organization":"lastminute.com Group","shirt_size":"Women's S","title":"VisualScrum 6 años desde la idea hasta la realidad","abstract":"Para todos aquellos con una idea que quieren poner en practica, les quiero inspirar a no abandonarla y perseguirla. Llevo 6 años esperando decir que una idea mostrada en una slide de la CAS 2010 es hoy una realidad, una board para definir el roadmap de un producto con SHs, MGM, POs y Devs.","description":"Hace 6 años tuve el placer de ser ponente por primera vez en mi vida y fue en una CAS. Llevaba pocos meses trabajando con Scrum y todo lo relacionado con visualizar me volvía atraía muchísimo. Llamé a mi charla Visual Scrum y en ella conté mis ideas sobre como la misma información había que presentarla de diferente manera según el rol de la empresa, y como podríamos crear diferentes boards para ellos. Unas de las boards que mas me gustaban eran las de la \"big picture\" para el management, algo que por aquel entonces estaba muy lejos de mi alcance. Por unas circunstancias y otras, mi perfil y mi entorno fue dando pie a necesitar otros tipos de visualizaciones del trabajo de los equipos, y pude experimentar esas ideas, llegando a conseguir un formato sobre el cual hoy  desarrolladores, product owners, stakeholders de diferentes países y management, definen la visión de una línea de negocio. 6 años esperando las condiciones adecuadas para poder convertir una idea en una realidad. Esta charla me permite poner la guinda a aquel pastel. Quiero enseñaros fotos de la charla original, de experimentos, de cómo son nuestras boards actuales y sobre todo quiero animaros a no dejar de persistir en aquello en lo que creéis. \r\n","notes":"","audience_level":"All","tag_list":[],"rating":100.0},{"name":"Carlos Montero","email":"carlos.montero@innovation4security.com","avatar":"https://secure.gravatar.com/avatar/558a0be3b03d47f27fdb7a5c10e0d5d4?s=500","location":"Madrid, Spain","bio":"Como product owner, me encanta el reto de hacer de traductor entre el mundo de negocio y los equipos de desarrollo. Esto lleva que explote mi visión más artística para lograr crear cosas que aporten valor y sean entendidas en ámbitos más técnicos.  \r\nPor otro lado soy un gamer empedernido y dibujante en mis ratos libres escuchando Rock N'Roll en cualquier momento del día!","twitter":"jaripES","url":"https://es.linkedin.com/in/cmonteroe, https://plus.google.com/u/0/communities/104006137025221336239","organization":"Innovation 4 Security","shirt_size":"Men's XL","title":"¿Seguridad en agile? ¡Dejamos de ser los villanos!","abstract":"Charla dirigida a todos los públicos donde se quiere demostrar que la seguridad puede entrar en los procesos ágiles de las empresas desde el comienzo con BDD evitando que llegue a última hora y ralentice las puestas en producción.","description":"La experiencia que la mayoría de la comunidad ágil tiene con los responsables de seguridad es la de los policías que no nos dejan desplegar nuestros productos según nuestra forma de trabajar. Al igual que la gente de servicios jurídicos o compras parece que la seguridad aún no ha entendido qué significa el desarrollo de software ágil. Esto debe cambiar, en esta charla comentaré la experiencia que hemos tenido en los equipos de desarrollo de i4s (dedicada a crear productos de seguridad para una gran entidad financiera) en la integración de historias de seguridad desde los primeros sprints. Esta aproximación se ha hecho a través de BDD para que también permitan a los equipos de desarrollo entender la necesidad de realizar desarrollos seguros. La creación de estas historias de seguridad se ha hecho desde la experiencia que tenemos como empresa de seguridad y de software y siguiendo estándares como el OWASP","notes":"Como Product Owner de herramientas de seguridad en una entidad financiera, me gustaría aportar mi granito de arena contando nuestra visión como expertos en seguridad que debemos formar parte de los equipos ágiles desde el inicio: historias de usuario relacionadas con la seguridad, automatización con Jenkins de los procesos de hacking, revisión de código, uso de BDD (con behave de Python) y Gherkin.","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Eduardo Ferro Aldama","email":"eduardo.ferro.aldama@gmail.com","avatar":"https://secure.gravatar.com/avatar/943321a1e0ccb3eb53f737fbf2592178?s=500","location":"Madrid","bio":"Solucionando problemas mediante software desde el 97. Apasionado por el código abierto, la colaboración, el crecimiento orgánico del software y por aportar valor. \r\nAlineado con el movimiento Software craftmanship, XP y agile. Experiencia de más de 5 años con la puesta en práctica de los principios, valores y prácticas agile.\r\n\r\n(perfil linkedin)[https://www.linkedin.com/in/eferro]","twitter":"eferro","url":"http://www.eferro.net","organization":"TheMotion","shirt_size":"Men's XL","title":"El arte del patadón pa’lante / posponer decisiones","abstract":"Lo óptimo es tomar las decisiones lo más tarde posible, con más información. Esto permite soluciones más sencillas y en algunos casos evitar trabajo innecesario. En esta charla expongo qué soporte necesitamos para poder posponer decisiones técnicas o de producto lo máximo posible.","description":"Posponer hasta el último momento responsable nos permite conocer mejor el problema a resolver, crear soluciones más sencillas y mejor adaptadas al problema.\r\n\r\nPero para poder posponer estas decisiones, se requiere que nuestro proceso y nuestro diseño de software, esté preparado para ello.\r\nEsto incluye hacer todas estas decisiones conscientes y explícitas. Asumir que lo que se decida es lo mejor que se pudo decidir en ese momento con lo que sabíamos y que si en el futuro se ha de cambiar, no hay problema.\r\n\r\nYa se sabe; la única constante es el cambio. Así que mejor abrazar el cambio.\r\n\r\nDicho así suena sencillo, pero la realidad es un poco más complicada. Posponer decisiones, desde el punto de vista técnico, significa que decisiones tan importantes como la persistencia de los datos, los tipos de comunicación entre los componentes, o en algunos casos, hasta el lenguaje usado para desarrollar algunas de las partes, se van a proponer a etapas muy avanzadas del desarrollo. Como además desarrollamos de forma ágil significa que muchas de estas decisiones llegarán cuando el sistema ya lleve tiempo en producción.\r\n\r\nEsto pone mucha presión en la calidad técnica del sistema, en tener una arquitectura fácil de evolucionar y un sistema fácil de modificar (confiable, con tests, feedback, etc).\r\n\r\nEsta charla explicará los motivos para posponer, las ventajas, las dificultades y explicará de forma práctica qué podemos hacer para posponer decisiones (arquitectura, simple design, parallel changes, etc).\r\nTambién se explicarán algunas estrategias para descomponer historias de usuario de forma que parte de ellas se puedan posponer (incluso indefinidamente si existen otras prioridades).","notes":"Una presentación similar la prepare para el AOS2013 con una muy buena aceptación. En este caso, actualizaré el contenido con alguna experiencia adicional, pero la base del contenido puede encontrarse en este [blog post](http://www.eferro.net/2013/06/el-arte-del-patadon-palante-postponer.html)","audience_level":"Intermediate","tag_list":[],"rating":100.0},{"name":"Angel Villa","email":"angel@on4u.es","avatar":"https://secure.gravatar.com/avatar/2205c022d02f25f4a9f853c45b41ee98?s=500","location":"Vitoria-Gasteiz","bio":"Ingeniero Informático de formación, empecé a gestionar mi propia empresa cuando aún estaba en la universidad.\r\nEspecializado en Magento (50+ proyectos desde 2009), estoy certificado como Developer y Solution Specialist.\r\nComparto 100% la filosofía del Software/Conocimiento Libre e intento ponerla en práctica en todos los aspectos de mi vida.\r\nActualmente soy el SCRUM Master de mi equipo.","twitter":"ashiak","url":"http://www.on4u.es/","organization":"On4u Global Services","shirt_size":"Men's L","title":"On4u: de una microgestión a un modelo distribuido basado en metodologías ágiles","abstract":"Somos una empresa de developers que durante el último año hemos vivido una gran evolución en nuestra forma trabajo. \n\nContaremos cómo hemos pasado de un modelo tradicional basado en la microgestión a uno ágil y distribuido, analizando los principales retos que nos hemos encontrado por el camino.","description":"On4u es una empresa de desarrollo de software especializada en plataformas eCommerce. Actualmente somos 17 personas, la gran mayoría developers.\r\n\r\nEn la charla contaremos cómo hemos ido creciendo durante estos años y cómo ha ido evolucionando nuestra metodología de trabajo: de una metodología tradicional basada en la microgestión a un modelo distribuido basado en metodologías ágiles.\r\n\r\nAdemás contaremos cómo hemos abordado con Scrum ciertas dificultades como:\r\n\r\n*  Somos una empresa de servicio, no de producto\r\n*  Casi un 50% de nuestro trabajo son mantenimientos evolutivos con SLA (incidencias urgentes)\r\n*  Muchos de nuestros proyectos, no son ágiles desde el lado del cliente\r\n\r\nPor último, mostraremos cómo utilizamos internamente las herramientas de Atlassian (Jira, Confluence y HipChat) en el día a día.\r\n","notes":"","audience_level":"All","tag_list":["agile management","business agility","success cases","change management","agile contracts","culture","distributed teams","multidisciplinary teams","scrum","teams"],"rating":0.0},{"name":"Sergio Bisello","email":"sbisello@gmail.com","avatar":"https://secure.gravatar.com/avatar/2adeed893a7e280cdd6d910541037dd7?s=500","location":"Unknown","bio":"I am an Agile Coach passionate and enthusiastic about Lean principles and internet economy.\r\nI have more than 14 years of experience delivering mission critical and enterprise software in multicultural environments. In the last 2 years, I have been working with Skyscanner initially as project manager and more recently as an agile coach. In this journey, I have seen how the company has invested a lot of effort on scaling the agile mindset despite of the huge growth and the geographical distribution. Given the current results, the effort has paid out.   ","twitter":"sbisello","url":"https://www.linkedin.com/in/sergiobisello","organization":"Skyscanner","shirt_size":"Men's 3XL","title":"Being an Agile Coach in Skyscanner - A swiss army knife role","abstract":"Helping teams and individuals to work together in a continuously evolving context is the main goal of agile coaches in Skyscanner. In this talk, I will explore, using day to day examples, the different competencies that Skyscanner's agile coaches put into practice to succeed in their goal. ","description":"Using the [ACI](http://agilecoachinginstitute.com)’s Agile Coach [Competency Framework](http://www.agilecoachinginstitute.com/wp-content/uploads/2011/08/Agile-Coaching-Competencies-whitepaper-part-one.pdf) as a route map, we'll go through different real life examples of how the agile coaches have helped to solve problems at different organizational levels, such as:  Leading the adoption of Squads and Tribes model at company level in order to support the massive growth Skyscanner has had in the last 3 years and coaching product owners or scrum masters to consolidate self organized and self managed teams, among others.","notes":"I can do this talk in both English or Spanish, being Spanish my favorite option.","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Israel Alcázar","email":"israelalcazar@gmail.com","avatar":"https://secure.gravatar.com/avatar/ba226699149cde621a370b0302509d4b?s=500","location":"Madrid - Barcelona - Europe","bio":"Apasionado del software desde temprana edad pasó sus primeros años como Ingeniero del Software. Tras descubrir que su verdadera pasión y potencial estaba ayudando directamente a las personas en los equipos y proyectos en los que trabajaba pronto fue tomando diferentes responsabilidades mas orientadas a las personas.\r\n\r\nFormado en coaching ejecutivo, mediación y pensamiento visual disfruta ayudando a organizaciones a transformar y mejorar sus paradigmas actuales de trabajo donde el foco principal está sobre todo en la mejora continua y las personas como centro de todo cambio.\r\n\r\nActualmente, Israel es Agile Coach, Mentor y Formador en metodologías ágiles y socio co-fundador de  [Thinking with you](http://thinkingwithyou.com), empresa especializada en cambio organizacional y metodologías ágiles desde donde trabaja y colabora con clientes de diversos sectores como banca, seguros, videojuegos o agencias de viaje online así como con algunas startups del panorama nacional.\r\n\r\nIsrael también es socio co-fundador de [Agile Taste](http://agiletaste.com), empresa dedicada a la creación de experiencias donde se mezclan enfoques Agile y Lean con la gastronomía. \r\n","twitter":"ialcazar","url":"http://israelalcazar.com","organization":"Thinking with you","shirt_size":"Men's L","title":"Modelos de evolución de equipos","abstract":"Charla continuación de la introducción que realicé en la [apertura del track de Equipos](https://www.youtube.com/watch?v=QHzvXRHdj2Y\u0026t=100s) en la pasada CAS2015. Me gustaría adentrarme en diferentes modelos de evolución de equipos y grupos mas allá del ya conocido Modelo de Tuckman.","description":"Los equipos nace, crecen, evolucionan y mueren. En esta charla me gustaría realizar un bonito recorrido sobre diferentes modelos de evolución de los equipos y grupos de trabajo mas allá del archiconocido modelo de Tuckman.\r\n\r\nEn esta charla, trataré de exponer de una manera amena y práctica modelos como el desarrollo grupal de Susan Wheelan, formación de equipos de [Homans](https://en.wikipedia.org/wiki/George_C._Homans), Rendimiento de equipo de Drexler y Sibbet o todos los conceptos aportados por [Wilfred Bion](https://en.wikipedia.org/wiki/Wilfred_Bion) desde el campo del psicoanálisis aplicado a grupos de trabajo. Todo ello asociado a casos prácticos aplicados de mi experiencia en la evolución de los equipos en los que he trabajado.","notes":"","audience_level":"All","tag_list":[],"rating":0.0},{"name":"José E. Rodriguez Huerta","email":"jrhuerta@smokingbrains.com","avatar":"https://secure.gravatar.com/avatar/1233fb1aa28e44be315320ccb714e8d1?s=500","location":"Barcelona","bio":"José E. Rodríguez cursó estudios en la Licenciatura en Ciencias de la Computación en la Universidad de La Habana.\r\n\r\nDurante su carrera profesional, con más de 10 años de experiencia en el desarrollo de software aplicado a sectores como: turismo, seguridad, logísticas y marketing online, ha incorporado a su repertorio de herramientas las metodologías ágiles. Destacan su experiencia con XP, KANBAN y SCRUM, en la cual ostenta varias certificaciones de la Scrum Alliance (CSM, CSPO, CSD)\r\n\r\nColabora como profesor invitado en programas de máster de universidades como el Centro Universitario de Diseño de Barcelona (BAU), la Universidad Ramón Llull (La Salle) y programas de mentoría en bootcamps como Ironhack.\r\n\r\nComo consultor organizacional en Smoking Brains combina dos de sus pasiones: la agilidad y el coaching de equipos para ayuda a organizaciones a ser más efectivas y obtener mejores resultados.\r\n\r\nEn su tiempo libre participa activamente en la comunidad Agile en Barcelona, Toastmasters Internacional y Software Craftsmanship Barcelona, de la cual es co-fundador.\r\n","twitter":"jrhuerta","url":"http://www.smokingbrains.com/es","organization":"SMOKING BRAINS S.L.","shirt_size":"Men's L","title":"La muerte del silo","abstract":"Es sorprendente lo poco que sabemos de los silos y sin embargo los encontramos por todas partes. En esta charla vamos a explorar las causas de que se manifieste este fenómeno, cómo podemos evitarlo y qué hacer para eliminarlos.","description":"Imagina el típico problema de mates: Juan construye una casa en 3 días y Pedro, la misma casa, en 4, ¿trabajando juntos, cuánto tardarían?\r\n\r\nAunque la respuesta lógica es que juntos tardarían menos, la experiencia nos dice que cuando se trata de colaborar en una organización, no siempre es así. \r\n\r\nTodos hemos sido víctimas de mala colaboración: departamentos que no se entienden, personas dentro del equipo que no comparten información, developers y diseñadores, etc.\r\n\r\nCada vez más nos encontramos con que aunque todo el mundo quiere lo mejor para la organización, no logramos ponernos de acuerdo para colaborar efectivamente.\r\n\r\nEsto no es una sorpresa; la mentalidad de silos a existido desde siempre. Sin embargo es sorprendente lo poco que sabemos de este fenómeno. \r\n\r\nEn esta charla vamos a explorar las causas de que se manifiesten estos fenómenos, cómo podemos evitarlos y qué podemos hacer para eliminarlos. ","notes":"","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Angel Diaz-Maroto","email":"adiazmaroto@gmail.com","avatar":"https://secure.gravatar.com/avatar/8161ffb2f8121a76bb87ed6048863476?s=500","location":"Spain","bio":"Angel is a very energetic Enterprise Coach who truly enjoy challenges. As a trainer, coach, and mentor, he supported several multinational organizations in their Agile journeys such as ING, eBay, King, Roche, Banco de Chile, Falabella, Toyota, Banco Sabadell and Abanca among others.\r\nDuring his 17+ years of experience, Angel worked as: Agile coach, R\u0026D manager, software developer, software architect,   ScrumMaster, and trainer.\r\nAngel is a Certified Specialist in team coaching and systemic leadership, Certified Enterprise Coach, Certified Agile Leadership Educator and Management 3.0 licensed trainer.\r\nHe teaches video game production at ESNE (University of Design, Innovation and technology) and Design Thinking at LaSalle University. And participated as a speaker in 30+ international conferences and Agile events in Europe and Americas.","twitter":"adiazmaroto","url":"","organization":"Agilar","shirt_size":"Men's M","title":"Learning to Learn: Leadership For Business Agility","abstract":"Business agility is creating a learning organization that is every time faster and better at learning about themselves and their customers. This talk is about understanding the key factors and leadership style required to nurture learning organizations in order to boost business agility.","description":"What comes to mind when you hear the word agile? Probably Agile software development methodologies like Scrum will come to mind. For everyone else in large organizations, however, the word suggests business agility.\r\nLeading for business agility It’s about understanding and nurturing the mindset needed to get an holistic understanding of agility.\r\n\r\nAs a result, the Scrum Alliance is expanding its mission. “Agile is now much more than a revolutionary approach to work for the software development industry, It’s transforming a wide variety of industries and specialties from marketing and human resources to financial services.” Manny Gonzalez, CEO of the Scrum Alliance.\r\n\r\nI believe business agility is creating a learning organization that is every time faster and better at learning about themselves and their customers. We are creating a new generation of organizatios that gets its value from their learning capabilities. Therefore Leading to learn is critical to succeed in business agility.\r\n\r\nThe Manifesto’s focus on better software was what the industry needed at the time. “The Agile Manifesto was an awesome kickstarter from 2001, because we had this customization challenge, but now, we’re pushing to get the rest of the organization aligned. It’s not just about better software, it’s about better business.\r\n\r\nWe’re in a \"customization revolution\" where software drives business agility by helping companies focus on individual customer preferences.  Customers don’t care about your product. They care about their needs, the product is a means of customer communication and delight, not the goal itself. An organization won’t be in touch with such preferences unless it is a learning organization.\r\n\r\nAs a Certified Agile Leadership Educator by the Scrum Alliance, I'll share my thoughts about the key factors and leadership style required to nurture learning organizations in order to boost business agility.","notes":"This talk is an extension to the content of the following article:\r\nhttp://www.forbes.com/sites/jasonbloomberg/2016/09/12/rethinking-agile-learning-and-leadership-for-business-agility/#7c10c3771002","audience_level":"Advanced","tag_list":[],"rating":0.0},{"name":"Jose Manuel Beas","email":"hola@jmbeas.es","avatar":"https://secure.gravatar.com/avatar/c3ff19a1940720828662878edb6f82a5?s=500","location":"Madrid (España)","bio":"","twitter":"jmbeas","url":"http://jmbeas.es","organization":"","shirt_size":"Men's L","title":"La cena de los idiotas. Aprende a mejorar las reuniones de planificación","abstract":"La planificación de sprint es una ceremonia compleja que requiere práctica y que está sujeta a dinámicas perversas. Por eso hemos diseñado un divertido \"role play\" con personajes y situaciones simuladas que nos permiten explorar soluciones más creativas a los retos del “mundo real”.","description":"Como en [la famosa obra de teatro](https://es.wikipedia.org/wiki/La_cena_de_los_idiotas_(obra_de_teatro)) de la que hemos robado el título de este taller, a veces pareciera que vamos a las reuniones con un invitado absolutamente esperpéntico: nosotros mismos. \r\n\r\nEn este taller tomamos como excusa una reunión de planificación de sprint que, junto a la retrospectiva, es probablemente la más compleja de un equipo Scrum, pues nos expone a comunicarnos entre pares, comprender los puntos de vista de los demás, negociar, llegar a compromisos, tomar decisiones compartidas, gestionar la frustración por no cubrir las propias expectativas… Situaciones poco habituales para gente acostumbrada a decirle a una máquina lo que tiene que hacer, sin más repercusión que un mensaje de error. \r\n\r\nEn fin, qué te vamos a contar que no hayas vivido. Bueno, quizás aún no. No te preocupes, este taller es para todos los públicos. Apenas necesitas conocer los fundamentos de Scrum para que no te sorprendan algunas de las palabras que deberás emplear al convertirte en actor o actriz por un rato.\r\n\r\nEste taller será impartido por José Manuel Beas y Maica Trinidad.","notes":"Propuesta presentada por José Manuel Beas y Maica Trinidad. Se trata de una dinámica diseñada por nosotros mismos, evolución de un taller que hemos ejecutado con algunos de nuestros clientes.\r\n\r\nRecursos: Mesas de unas dimensiones aprox para 4-7 personas\r\nDuración: 1h\r\n\r\nIdioma: Español / English if attendees need it\r\n","audience_level":"Beginner","tag_list":[],"rating":50.0},{"name":"Dino Zafirakos","email":"dino.zafirakos@gmail.com","avatar":"https://secure.gravatar.com/avatar/59a7443659532f0c8d7234594329703f?s=500","location":"Unknown","bio":"Dino is an Agile coach and Scrum Master with several years of experience, guiding and empowering teams and organisations to achieve the best possible results. This is achieved by encouraging proven technical practices, applying Agile and Lean values, great communication skills and a sense of humour! He is currently found lurking in Typeform, aiding the organisation in its Agile journey while maintaining its continued growth.","twitter":"dinozaf","url":"","organization":"Typeform","shirt_size":"Men's M","title":"A Practical tour of V2MOMs","abstract":"Pioneered by Salesforce, V2MOMs are a simple way to allow every individual and team within an organisation to move in a clear and well-defined direction. We will learn why V2MOMs are useful, what they are and how they can be applied in your organisation, including real-life examples.","description":"We have seen various strategies and ideas to improve collaboration and communication between teams within organisations, yet we face the challenges of maintaining alignment despite changing plans and goals. How can an organisation's leadership align with the teams in the front-lines and maintain autonomy while maintaining focus?\r\nWe will see how V2MOMs originated in Salesforce and helped them achieve astounding growth and excellence. They are comprised of:\r\n- A common *vision* to follow. \r\n- The *values* that define the principles of the organisation. \r\n- The specific *methods* to achieve the desired goals. \r\n- The identified *obstacles* that need to be overcome to achieve our goals. \r\n- The specified *measures* that assure that the goals have been met. \r\nWe will take a deeper dive into V2MOMs: why they are a compelling tool to use at a company, team, or individual level. We will discuss the mechanics involved in creating them, along with practical examples of their use in Typeform and what we’ve learnt along the way. We will also get a chance to create our own V2MOMs!","notes":"This talk will discuss V2MOMs: why they could be interesting to apply in any level of an organisation, what they are and how to use them. This talk will also offer some examples based on our experience and success in defining team-focused and company-wide V2MOMs each quarter (3 months) to align everyone as the organisation continues to expand.\r\nAs a Scrum Master and Agile coach in Typeform, I have facilitated various sessions to define and align V2MOMs along with facilitating improvements to the V2MOM creation and maintenance process. I have worked in Scrum teams using V2MOMs as their main driver for success in their daily work and seen how V2MOMs help the POs prioritise their backlogs, team members maintain a bigger picture view of the product, but also myself as a Scrum Master to understand what to focus on to help the organisation improve.\r\n\r\nThe majority of the talk will be presented via projector. There will be an exercise to get the audience to try out themselves which will take a few minutes (factored in the time of the talk).","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Roberto Canales Mora","email":"rcanales@autentia.com","avatar":"https://secure.gravatar.com/avatar/67a59424d45af545b4480ef8655d6123?s=500","location":"Torrejón de Ardoz, Madrid","bio":"CEO de Autentia\r\nConsejero delegado tea.ms (Startup/Intra-emprendimiento)\r\nProfesor Asociado IE en programas de Dirección de Transformación Digital y Dirección Estrategica de Proyectos\r\nMentor de emprendedores en Cink Emprende y otras iniciativas\r\nCreador de AdictosAlTrabajo.com\r\nPromotor de Terrakas.com\r\nInversor en StartUps","twitter":"rcanalesmora","url":"https://www.linkedin.com/in/rcanales/es","organization":"Autentia","shirt_size":"Men's L","title":"Transformación digital y metodologías ágiles: desde CEOs a equipos","abstract":"¿Cómo contarle a un CEO, un CIO, recursos humanos y un équipo técnico qué es la transformación digital y cómo cuadra con las metodología ágiles sin que se pierdan? La gente necesita un trayecto claro inicial antes de plantearse formalismos de frameworks de escalado.","description":"Durante años en Autentia hemos implantando metodologías ágiles desde las trincheras, es decir, dando soporte a equipos de arquitectura y desarrollo acompañandolos en la construcción de pilotos/frameworks corporativos y trabajando de facto con un modelo ágil / XP.\r\n\r\nClaramente se ve un cambio de tendencia donde ahora tambien son los CEOs y CIOs, de todo tipo de empresas, los que tienen presión para mover una transformación corporativa, buscando como aplicarlo en sus niveles intermedios y sin saber muy bien como cuadra el modelo completo o qué pasos seguir a corto plazo. \r\n\r\nEn cada vez más programas en escuelas de negocio \"metodologías ágiles\" es una asignatura ¿cómo captar la atención de los influencers?\r\n\r\nEn esta charla planteo el discurso que tenemos para explicarlo, cuadrando todos niveles, desde estrategia a devops:\r\n\r\n- Qué es la transformación digital y su relación con el agilismo.\r\n- Como se pueden hacer proyectos más rápido.\r\n- Cómo se pueden hacer más proyectos a la vez.\r\n- Cómo se puede mejorar la calidad percibida y estructural de los proyectos.\r\n- Cómo se puede ganar homogeneidad de prácticas en distintos equipos.\r\n","notes":"En Autentia somos ya 60 personas realizando esta labor durante años y participo activamente en todos los arranques, aparte de tener que venderlo, seguro que tenemos algo que contar, y como siempre sin ser políticamente muy correcto, ni decir lo que la gente quiere escuchar.","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Miquel Rodríguez","email":"miquelra@netmind.es","avatar":"https://secure.gravatar.com/avatar/89661da1986d46fbd9c5cfcafbba868f?s=500","location":"Terrassa","bio":"Miquel combina su actividad como Director de Consultoría en Netmind, con el liderazgo del área de Agile Management. Ingeniero en Informática de Sistemas, dispone de un MBA, un Master en Gestión TI y el Executive Program en Design Thinking for Business Innovation de ESADE. Los últimos 15 años su carrera profesional ha estado ligada a la gestión de las TIC, compartiendo su actividad como consultor con la impartición de formación. Colaborador en distintas universidades y escuelas de negocios, como el Instituto de Empresa o la Barcelona Technology School, desde hace más de 5 años ayuda a las organizaciones a liderar y gestionar su transformación agile. En los últimos años ha participado en proyectos de transformación Agile y organizativa en empresas como Telefónica Digital, BBVA, Repsol, Grifols, Bacardi, CIRSA, Ferrer o Pronovias.\r\n\r\nSimultáneamente, Miquel Rodríguez es el Director Académico del Master in Digital Solutions Develoment en la Barcelona Technology School, donde al mismo tiempo imparte la asignatura Agile.","twitter":"miquelrodriguez","url":"https://www.linkedin.com/in/miquelrodriguezaranda","organization":"NETMIND","shirt_size":"Men's 2XL","title":"Historia de una transformación ágil en Ferrer","abstract":"En los últimos 2 años el Departamento de Organización y Sistemas de Ferrer ha vivido un cambio organizacional de un modelo de gestión de proyectos tradicional a un modelo ágil. Nuevos roles, nuevas responsabilidades, equipos Scrum, paneles Kanban, entregas frecuentes, … ¿Quieres saber cómo fue todo?","description":"El viaje empezó con una necesidad de formación en gestión de proyectos. En lugar de plantear una formación estándar, todo el Departamento participó en un Project Management Improvement Workshop, donde el objetivo fue que todo el personal dibujara conjuntamente su propio escenario ideal después de ver diferentes modelos y analizar los pros y contras. Con este enfoque bottom-up, se creó una hoja de ruta hacia un modelo ágil empezando por un piloto y una redefinición de roles. Los equipos empezaron a trabajar por Sprints, con una persona centrada en el rol de Product Owner por cada equipo. Algunas unas herramientas de gestión se sustituyeron por paneles Kanban en las paredes de los despachos y salas de reuniones. En las primeras retrospectivas se constató que el modelo había mejorado los tiempos de entrega y la sensación de aportar más valor a los usuarios. Si quieres aprender más detalles acerca de la evolución de un modelo de gestión tradicional a un modelo ágil en equipos que trabajan con tecnologías tan diferentes como SAP, Salesforce o .NET, esta es tu sesión. ","notes":"Esta sesión está pensada para personas que empiezan a introducirse en Agile, y que quieren ver qué tal le ha ido a una conocida empresa tradicional del sector farma (Ferrer son los que hacen el Gelocatil...). No se trata de nuevas técnicas innovadoras, ni disrupción total. Se trata de ver una adopción de Agile, con pros, con contras, .... explicaremos el viaje con Ferrer, los pasos realizados, los beneficios obtenidos.... \r\n\r\nEsta charla ya fue presentada en abril en el GigaTIC, evento de itSMF, con muy buen feedback (http://itsmf.es/index.php?option=com_content\u0026view=article\u0026id=2209:ficha-gigatic2016-miquel-rodriguez-aranda\u0026catid=79:noticias\u0026Itemid=401). \r\n\r\nHay un resumen de la charla publicado en el blog de Netmind (http://www.netmind.es/noticias/historia-de-una-transformacion-agil-en-ferrer-caso-de-exito/).\r\n\r\nEn esta segunda iteración, la charla está mejorada y ampliada con nuevo feedback de Ferrer desde entonces. Además, dedicaremos la mitad del tiempo (20 min aprox) a preguntas y respuestas, ya que está orientada a beginners.","audience_level":"Beginner","tag_list":["agile management","business agility","success cases","kanban","scrum","teams"],"rating":0.0},{"name":"Juan Bacardit Barrera","email":"juan.bacardit@ingenba.com","avatar":"https://secure.gravatar.com/avatar/8f84ee6609069e22fc3e00332e79f42e?s=500","location":"Unknown","bio":"Computer science engineer, post-graduated in Lean Manufacturing. Passionate for well-crafted software! Developing enterprise software since 2003, working from startups to large companies. University teacher of software engineering at UPC. Always looking how to improve and reduce worthless tasks. Scrum Master, Technical Coach, Enterprise architect and software developer at multinacional companies. Sponsoring of XP, CI, CD and DevOps cultural changes, and training IT and Dev teams to be able to establish a frequent delivery pipeline. Technical speaker in the software craftsmanship community.  Working at Agilar as a Technical Coach and Scrum Master.","twitter":"juanbacardit","url":"http://www.juanbacardit.com","organization":"Agilar","shirt_size":"Men's M","title":"EDD: Experiment Driven Development","abstract":"Lean UX: haz una hipótesis y verifica como se comporta tu producto para pivotar a tiempo. Utilizar EDD como un paso adelante en la creación de productos, teniendo como driver la creación de experimentos y su resolución. Un paso adelante tras conocer y trabajar de forma normalizada con TDD y BDD. ","description":"Quien mejor que el cliente para saber que es lo mejor de tu producto,... imagina que pudieras tener el cliente siempre cerca y obtener una información veraz de lo que espera de tu producto, que opciones son las más aceptadas y valoradas, como quiero utilizarlo, que funcionalidades no dan resultado...  tu producto sería exitoso des del primer momento. \r\n\r\nEDD expone un modelo de desarrollo de producto basado en experimentos: hipótesis, prueba, resultado, decisión, hipótesis.... \r\n\r\nDurante esta vamos a ver como llevar a cabo este proceso, que capacidades debe tener el equipo, que herramientas son útiles para el desarrollo de estás dinámicas, etc.. ","notes":"Esta charla esta basada en la experiencia  que hemos adquirido trabajando con personas de marketing, desarrollo, seguridad que ofrecen un producto con más 8MM€ de ingresos anuales. Y como el modelo de experimentar es un modelo de constante mejora continua de su producto. \r\n\r\nEsta charla se ha hecho en la softwarecraftsmanship de barcelona, en un formato más técnico. Entrando principalmente en las herramientas necesarias para llevar a cabo un desarrollo de software guiando el desarrollo por experimentos","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Fernando París","email":"ferparis@gmail.com","avatar":"https://secure.gravatar.com/avatar/513e9b8533a11e5c7151bbd727945c4e?s=500","location":"Unknown","bio":"We are what we can do, not what we know, so lets keep on learning. Newbie Father and tech enthusiast trying to improve on daily basis\r\n\r\nhttps://www.linkedin.com/in/fparis","twitter":"ferparishuertas","url":"","organization":"","shirt_size":"Men's 2XL","title":"Product Ownership is a Team Responsibility","abstract":"In agile, we always talk about teams, quit barriers, group workforce, and other big buzzwords, but when we focus on product ownership, we focus on a given isolated role. The product is build by a team. Why not build teamownership, rather than focusing all on a given role. Product Success = TEAM","description":"Agile is like faith, given a context, everybody has its own perception of reality. That happens with the Product Owner role interpretation too.\r\n\r\nWhy we fall into Command and commander,  I am the product owner and this how we do things instead helping, facilitating the team a deeper understanding of the product?\r\nHaven't you experienced cases where the team had a better idea, a brilliant one or found a shorter and better way to reach the goal?\r\n\r\nOn my experience roles are facilitators but the team must have an overall picture, and ownership to success? How\r\n\r\nStart giving the team a clear business perspective\r\nInception\r\nStory Mapping\r\nFind competitors, study the market\r\nPeople over roles\r\nShares responsibilities to help each other\r\nBuild trust between all team members\r\nBuild new ideas\r\n","notes":"My aim is to share my experience on building teams, cross department, where the ownership is not only role based. The product owner role is really needed, but we mustn't delegate all product related things to this given role. Its a startpoint but not a goal.  Building requirement, finding quick wins, innovating, acceptance criteria, competitor overview, customer feedback is a team responsibility not only PO's work\r\n\r\n why there are discussions about if product owners are part of the team or not? Aren't we all developing a product together?\r\nI think the real ownership star empower teams to build product ownership. I am not saying that the product owner role is not needed but ownership of the product is not his alone responsibility. Its a team responsibility, and the better we understand the business as a team, the better product we can develop. Steps to reach this path:\r\n\r\nStart giving the team a clear business perspective\r\nInception\r\nStory Mapping\r\nFind competitors study the market\r\nPeople over roles\r\nHelp us each other\r\nShares responsibilities to help each other\r\nBuild trust between all team members\r\nBuild new ideas\r\n\r\n\r\n","audience_level":"All","tag_list":[],"rating":50.0},{"name":"Evgueni Talal","email":"evgueni.talal@gmail.com","avatar":"https://secure.gravatar.com/avatar/c1ef3c5235426988ec2b5a7846ee7e41?s=500","location":"Unknown","bio":"Evgueni is a training consultant and coach specialized in developing more Effective Collaboration within organizations.\r\n\r\nHe applies his experience in Coaching, Neuro-Linguistic Programming, Systemic Coaching and Change Management to help organizations, teams and individuals create more constructive dynamics that allow them to deliver a higher level of value to the organization and its customers.\r\n\r\nHe is also the Co-founder of Smoking Brains, a strategic consultancy firm in Barcelona, whose objective is to help organizations to achieve a higher level of effectiveness and performance.","twitter":"","url":"http://www.smokingbrains.com","organization":"Smoking Brains","shirt_size":"Men's L","title":"007 Agente de Cambio","abstract":"La mayoría de nuestros intentos de transformación suelen toparse con inercia y resistencia en nuestro entorno.\nEsta charla ofrece herramientas para que los asistentes puedan convertirse en Agentes de Cambio capaces de transformar sus organizaciones desde dentro sin volverse locos en el proceso.","description":"Todos queremos mejorar las cosas, por eso estamos aquí en la CAS, pero muchas veces nos chocamos con la inercia de la empresa donde nos encontramos. Eso nos lleva a la frustración y al desánimo por la dificultad de mover las cosas dentro de una empresa que parece incambiable. Da la sensación que siempre nos topamos con obstáculos, con falta de motivación y de cooperación o incluso con resistencia o sabotaje.\r\n\r\nEsta charla ofrece pautas y herramientas concretas para gestionar estas dificultades e introducir nuevos cambios de manera progresiva.\r\n\r\nNos prepararemos a transformar nuestras organizaciones cómo nos prepararíamos para afrontar una campaña militar:\r\n- Eligiendo nuestras batallas con cuidado explorando el terreno y buscando alianzas\r\n- Ajustando el desafío a nuestras fuerzas\r\n- Ganando inercia\r\n- Construyendo sistemas de soporte que nos permiten mantener nuestros esfuerzos vivos sin acabar quemados o locos ;-)","notes":"Mi trabajo como consultor consiste en ayudar a las organizaciones a mejorar su manera de trabajar para alcanzar mejoras a nivel de efectividad y rendimiento.\r\n\r\nMi especialidad es acompañar a las personas, equipos y organizaciones en los procesos de cambio que emprenden, ayudándoles a definir nuevas maneras de trabajar, ponerlas en marcha e integrarlas en sus rutinas y su cultura. Para ello, utilizo técnicas procedentes de Coaching personal, Programación Neurolinguistica, Coaching sistémico y gestión del cambio.","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Rodrigo Corral","email":"corral_glez@hotmail.com","avatar":"https://secure.gravatar.com/avatar/8260b17eb53d6a0d178aea451d8847d9?s=500","location":"Unknown","bio":"I have been developing software since I was seventeen, first as freelance developer and then for companies like Sisteplant, leader in MES and CMMS software and Panda Security, one among the international leaders in software for security. I have been involved in a very interesting projects at Sisteplant builded using the latest Microsoft's Technologies and managed with Scrum from its begining.\r\n\r\nI am also one of the owners of Plain Concepts where I work  as advisor, mentor and coach for first line companies in a wide range of subjects like project management, agile methodologies, CMMI, Team System, software patterns and architectures, software configuration management. I am one of the members of the Plain Concepts' Debugging \u0026 Optimization Team, a group of high qualified and experienced professionals specialized in tracking down and resolving stability and performace problems in the whole .Net platform, SQL Server and Oracle.\r\n\r\nI have been recognized as Microsoft Most Valuable Professional in two different categories, Visual C++ and Team System, several times. I am also Microsoft Certified Trainer, Certified Scrum Master, Certified Scrum Practicioner and Professional Scrum Developer Trainer\r\n\r\nI administer Geeks.ms, a Spanish popular community site for Microsoft's technologies developers. I write a quite popular blog hosted at Geeks.ms.\r\n\r\nI love everything related to software development. Apart from software development, my main hobby is play ride my bike.\r\n\r\nSpecialties: Project management, agile methodologies, Scrum, Team System, architecture, distributed applications, Azure/Cloud Computing, .Net, Sql Server, advanced debugging and performance tunning.","twitter":"r_corral","url":"https://es.linkedin.com/in/rcorral","organization":"Plain Concepts","shirt_size":"Men's L","title":"Scrum Internals: ¿Por qué Scrum funciona?","abstract":"Scrum es la metodologías ágil que más se utiliza en la actualidad. ¿Por qué más y más equipos en empresas de todo tipo están adoptando esta metodología? ¿Por qué Scrum funciona donde otras metodologías han fallado? ¿Qué hace Scrum diferente?","description":"Scrum es la metodologías ágil que más se utiliza en la actualidad. ¿Por qué más y más equipos en empresas de todo tipo están adoptando esta metodología? ¿Por qué Scrum funciona donde otras metodologías han fallado?\r\n\r\nLa idea de esta sesión es revisar que aspectos de Scrum como metodología han hecho de ella un instrumento tan popular y exitoso para la gestión de proyectos.\r\nTambién se trata de ver que aspectos son importantes mantener en nuestro foco como Scrum Masters para lograr que la adopción de Scrum sea exitosa.","notes":"Dada mi experiencia de más de 12 años con Scrum, creo que fijarse en los valores, técnicas y características de Scrum que hacen que funcione puede ser un punto de vista interesante. He visto muchos equipos fallar en la adopción de Scrum por no conocer los fundamentos que hacen que Scrum funcione.","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Xabi Sáez de Ocáriz","email":"orezto@gmail.com","avatar":"https://secure.gravatar.com/avatar/5e214ecaa5c6cc4e697bdaec204e5720?s=500","location":"Unknown","bio":"","twitter":"ziraco","url":"","organization":"","shirt_size":"Men's M","title":"Tu código es una mierda (Comunicación en el desarrollo de software)","abstract":"El desarrollo de software es una disciplina social. Un alto porcentaje de nuestro tiempo consiste en transmitir o recibir pedazos de conocimiento de otras personas. ¿Dónde se encuentran los retos de comunicación en nuestro trabajo? ¿Cómo y por qué nos comunicamos cómo lo hacemos?","description":"La charla está dividida en 3 partes:\r\n\r\n1. **Conócete a ti mismo:** En la que hablo de cómo nos comunicamos como humanos, desarrollando software o no. Cómo los sesgos cognitivos y otros mecanismos de nuestra mente a veces nos entorpecen el camino para sacar el mayor partido a nuestra comunicación.\r\n\r\n2. **Tu código es una mierda:** Comunicación con otros desarrolladores. Por qué es importante saber comunicarnos a través del código. Cómo podemos mejorar en esto. Cómo hacemos compartimos conocimiento técnico, cómo compartimos conocimiento sobre nuestro dominio.\r\n\r\n3. **Hablando con esos de negocio:** Cómo trabajamos con nuestros clientes, con nuestros comerciales o nuestros product owners. Cómo transmitimos las decisiones que tomamos desde la parte técnica y qué efecto tienen en negocio. Cómo recibimos las cuestiones relacionadas con dinero. ¿Nos entendemos?\r\n","notes":"","audience_level":"All","tag_list":[],"rating":100.0},{"name":"Alejandro Asensio González","email":"aasensio@paradigmadigital.com","avatar":"https://secure.gravatar.com/avatar/3bd259604d3308b3327631384b670a9f?s=500","location":"Unknown","bio":"","twitter":"kenzilab","url":"","organization":"Paradigma Digital","shirt_size":"Men's XL","title":"¿Ofertas responsables? ¡Es posible!","abstract":"¿Has tenido que realizar una oferta sin información suficiente? Para paliar esta situación, trabajamos con un modelo de colaboración para construir una oferta responsable. A través de una serie de dinámicas y buenas prácticas podemos presentar una oferta y al día siguiente, comenzar el proyecto .","description":"En muchas ocasiones nos enfrentamos ante la necesidad de preparar una oferta con tiempos y costes para desarrollar una aplicación de la cual no se tiene la suficiente información. Para paliar esta situación, se puede proponer un modelo de colaboración, previo a la presentación de la oferta, que facilite la construcción de una oferta responsable. El resultado es una serie de dinámicas, acciones y buenas prácticas que permiten además de sintonizar con el cliente, detectar de primera mano sus necesidades e inquietudes, estar en disposición de comenzar el proyecto al día siguiente de presentar la oferta.","notes":"En paradigma llevamos mucho tiempo implantando este tipo de dinámicas en las que los clientes confían en nosotros para obtener ofertas responsables y de calidad.","audience_level":"All","tag_list":[],"rating":50.0},{"name":"Maica Trinidad","email":"maicatrinidad@gmail.com","avatar":"https://secure.gravatar.com/avatar/6f6a60115023a94084d76b506e7df43e?s=500","location":"Spain","bio":"","twitter":"MaicaTrinidad","url":"http://maicatrinidad.com/","organization":"reeeLab","shirt_size":"Women's M","title":"Saca el metro, prima, que vamos a medir el user entre todas","abstract":"El éxito de un proyecto depende de elegir bien el target usuario. Aunque tengas una idea estupenda y un excelente equipo de desarrollo si te equivocas ahí, fracasas.\nEs frecuente dejar esa elección a la subjetividad de negocio... pero hay otras formas más eficientes de hacerlo. Medir es la clave.","description":"En Agile contamos con diferentes herramientas para generar producto centrado en el usuario, pero ¿cómo elegimos nuestro target? \r\nDesgraciadamente, la mayor parte de las veces esta elección se basa en hipótesis no respaldadas por datos. Nuestro software rara vez incluye herramientas de medición que nos permitan validar o rechazar esas hipótesis de partida. Con una investigación acerca de segmentos de usuarios y sus necesidades muy escasa, centramos nuestros productos en los perfiles sociales que mejor conocemos o en nuestras propias necesidades, perdiendo con ello potenciales oportunidades de negocio y desperdiciando muchas horas en desarrollar producto con escasa aceptación.\r\nUna vez que nos damos cuenta de ello, pivotamos en nuestro producto, pero una vez más sin datos. Estamos intentando matar moscas a cañonazos.\r\nLa Customer Centricity es para nosotras mucho más que la UX. Esta charla tratará sobre la necesidad de introducir métricas para democratizar el debate acerca de cuál es nuestro target, optimizar las definiciones de nuestros usuarios y definir todo el viaje que harán por nuestro producto, porque no se trata de entregar esos datos a negocio, sino de sentar las bases de un proceso participado e \"intersubjetivo\" que deje atrás las suposiciones y la lucha de poder y nos lleve a entender mejor nuestras oportunidades de negocio.\r\nEsto requiere el trabajo en equipos diversos e interdisciplinares durante todas las fases de ideación y desarrollo. Se trata de integrar todos los pasos de nuestra cadena de valor desde el primer día, involucrando a profesionales de marketing, ventas y soporte desde las fases tempranas de ideación de producto, junto con diseñadores, UX y desarrolladores, además de los responsables de negocio. Sólo de esta manera podemos mejorar la calidad de nuestro producto y reducir nuestro time to market, centrándonos en los target que realmente van a usarlo.","notes":"Esta charla la impartiré junto a Raquel Lainde (https://twitter.com/lainde)","audience_level":"Intermediate","tag_list":[],"rating":0.0},{"name":"Philip Peter","email":"github@justgeek.de","avatar":"https://secure.gravatar.com/avatar/1e014f708ff09329a2febfb2c1a1063d?s=500","location":"Unknown","bio":"Philip is a software developer with experience in both web applications and hardware projects. In his spare time he likes to design electronic circuits and build mechanical things.\r\nOne of his current ambitions is to transfer the test-driven development and continuos integration to hardware.","twitter":"","url":"","organization":"ThoughtWorks","shirt_size":"Men's M","title":"Rapid prototyping - When Why, How?","abstract":"Having early prototypes is essential for agile projects, but traditional hardware development often can take years.\n\nThis is a talk about how easy it can be to create a hardware prototype. And how often reduction to a minimal prototype (styrofoam) can be helpful.","description":"Traditional hardware development workflows often take months or even years until the first prototypes are ready. On the other hand in software development we often try to test out new features every few weeks or even just after a few days.\r\nThere are more and more projects in which these two approaches collide and result in delays and overall frustration.\r\n\r\nGetting some early prototypes can be essential to do user testing, verify assumptions and define the interface between the hardware and software parts. This talk will give an overview of a few different kinds of prototypes, which ones you might need and how you can start building them.","notes":"","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Diego Rojas","email":"drobur@gmail.com","avatar":"https://secure.gravatar.com/avatar/9d8d6eed595895cdcaace5b0b7f3ba63?s=500","location":"Madrid, Spain","bio":"Co-fundador de Thinking with you, centra sus esfuerzos en el crecimiento personal, el desarrollo de equipos y el cambio organizacional. Su vocación es ayudar a encontrar claridad a través de la reflexión y búsqueda de perspectivas diferentes.\r\nFormado en ingeniería del software, coaching ejecutivo, CNV (Comunicación No Violenta) y DBM (Developmental Behavioural Modelling), tiene más de 10 años de experiencia en el área de IT siempre involucrado en temas de gestión de proyecto y desarrollo de equipos y procesos.\r\nEspecializado en Agile, Lean y Coaching ejecutivo con un enfoque sistémico y humanista, utiliza los roles de facilitador, consultor, coach y formador para la creación de contextos colaborativos que fomenten una cultura de mejora continua en los equipos y organizaciones que acompaña.","twitter":"drobur","url":"https://es.linkedin.com/in/drojas","organization":"thinkingwithyou.com","shirt_size":"Men's XL","title":"Exploración y acompañamiento","abstract":"Este es un taller muy practico donde los asistentes practicarán distintas maneras efectivas de explorar un problema y verán como ayudan a la otra persona solo con el acompañamiento. Es algo que pueden usar al día siguiente para ayudar a otros o para recoger información de otra persona. \n","description":"Actualmente se habla mucho de coaching y acompañamiento. No son lo mismo. En este taller reflexionaremos sobre el acompañamiento y practicaremos la habilidad de explorar. De manera practica nos centraremos en como podemos acompañar a otra persona en una dificultad ayudándole a explorar el problema. Para ello practicaremos con distintos modelos formales que ayudarán a la recogida y estructuración de la información y probaremos con ejemplos reales que traigan los asistentes como eso ayuda a la persona.","notes":"La duración optima para el taller son 2 horas.","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Oriol del Barrio","email":"orioldelb@gmail.com","avatar":"https://secure.gravatar.com/avatar/e2c7afc970b7ff56e2decc9599f8123b?s=500","location":"Barcelona, Spain","bio":"","twitter":"lordudun","url":"http://www.lordudun.es","organization":"Typeform, Agilebcn","shirt_size":"Men's L","title":"Make agile fun again","abstract":"Are your agile ceremonies becoming boring and unengaging? Is the team doubting the value of these meetings? Let us show you how we at Typeform use techniques like gamification and visualization to spice up our meetings and keep the team engaged","description":"After some iterations some teams can fall in the routine of “standard” agile ceremonies, making the outcome of the meetings less effective. This is why we needed to find new ways to engage the teams.\r\n\r\nWe will present the following techniques:\r\n\r\n- Energisers to break the daily mindset and move out the people of their concerns\r\n- Different dynamics in the retrospective to make them unpredictable\r\n- Introduce tools like “Stories cubes”, “Black stories” or “Dixit” to inspire people and promote lateral thinking\r\n- Use tactile tools instead of focus on Jira, Trello …\r\n- Draw and write ideas in flipcharts or other visualization tools\r\n\r\nWe will show some examples and at the same time we will rely on this tools to show how we use it.","notes":"This session will be done by Juan Antonio Sosa and me","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Gastón Valle","email":"gaston.valle@gft.com","avatar":"https://secure.gravatar.com/avatar/de754dd8e767e3b44b31038e5106e15d?s=500","location":"Sant Cugat del Vallès, España","bio":"**Gastón Valle**\r\nActualmente trabajo como Scrum Master y movilizador de las metodologías ágiles en GFT. Soy ingeniero informático, me gusta mucho dar soluciones a las necesidades de otros a través de un software y me gusta aun mas trabajar en equipos y con equipos.   \r\nSer coherente en la vida creo que es muy importante y en las metodologías ágiles encontré esa coherencia en el entorno laboral.\r\nSoy de la Patagonia, me encanta la naturaleza y la montaña y soy bastante friki del ski. \r\n","twitter":"gastonvalle","url":"http://www.gastonvalle.com","organization":"GFT","shirt_size":"Men's L","title":"Design sprints para inceptions","abstract":"El arranque de un proyecto siempre es un gran desafío y es crítico poder crear una definición clara y alinear a todos los involucrados... Los Design sprints son una herramienta que mezcla Design Thinking y Agile development que te ayudaran a hacer la mejor Inception! ","description":"En el arranque de un proyecto siempre hay muchas ideas, muchas perspectivas, conocimiento distribuido… Por eso es crítico poder crear una definición clara y alineada con la participación de todos los involucrados (diseño, experiencia, producto, desarrollo y todos los stakeholders necesarios).\r\nLa metodología de Design Sprints de google ventures es un framework basado en design-thinking y metodologías ágiles que google creó para startups y equipos. Diseño que permite comprender el contexto y necesidades, para pasar de ideas a concepto y facilitar el desarrollo de productos exitosos. Como Google Venture dice \"Working together in a sprint, you can shortcut the endless-debate cycle and compress months of time into a single week.\"\r\n\r\nEn este workshop compartiremos nuestra experiencia en inceptions mediante Design sprints:\r\n•\tCrear una visión única del proyecto\r\n•\tConseguir equipos multidisciplinarios que van alineados.\r\n•\tConseguir enfocarse al usuario y cliente final (Que a veces es diferente de lo que todos se esperan)\r\n•\tTrabajo colaborativo\r\n•\tIdentificar aspectos críticos, riesgos de operaciones y técnicos o tecnológicos, nada más arrancar el proyecto \r\n•\tAprender a validar con usuarios desde el día 1.\r\n\r\nAdemás compartiremos trucos, experiencias y lecciones aprendidas (lo que nunca te contaron: lo que no te contó el diseñador, lo que nunca cuenta el desarrollador y aquello que debería saber el PO). \r\n","notes":"Se trabajara por equipos. Según el numero de inscritos tendremos de 2 a 4 facilitadores en la sala: Scrum master, Diseñadores y Negocio…\r\nSe necesitara una sala para trabajar en equipos\r\nPost-its, rotuladores y flipchart.\r\nLas ganas y la energía ya las traemos de casa ;)\r\n\r\n\r\n**Bio de Silvia Calvet** (No está en mi perfil)\r\nTrabajo en GFT. Me muevo en la intersección  de la marca y las personas, buscando crear experiencias. Trabajo buscando impacto mediante el diseño, las personas y la colaboración.\r\nI love to share, learn and collaborate!\r\n","audience_level":"All","tag_list":["design thinking","inceptions","ux"],"rating":50.0},{"name":"Marta Rosson Llobet","email":"martarosson@gmail.com","avatar":"https://secure.gravatar.com/avatar/8021831e236134b2d626122080e5157d?s=500","location":"Unknown","bio":"More than 15 years of experience within the IT banking industry in many disguises: Business Analyst, Project Manager, Scrum Master, Product Owner, Agile Coach…. Spent half of my working life trying to give information out, the other half trying the get communication through…  Still trying…","twitter":"MartaRosson","url":"","organization":"GFT IT Consulting SL","shirt_size":"Women's M","title":"Information vs communication: giving out vs getting through","abstract":"How to go from one to another, achieve shared understanding and align business, developers, testers and analysts with one simple practice.","description":"Traditionally, business analysts have played the role of translators between the business and the technology worlds. \r\nLean and agile earlier software practices focused on reducing the bottleneck in the development process. Later, frameworks like Scrum focused on how to organise teams in such environments. But the communication gap will not be removed if information goes back and forward from business to technology...  Information may be flowing, but is communication really getting through?\r\nThis talk will focus on how to overcome the lack of communication, define which best practices can help achieve a shared understanding and describe how to develop the feedback loops required to ensure the alignment between business and IT that is so crucial yet so often overlooked.\r\n","notes":"Mi primer contacto con Agil fue durante una transformación organizacional en UBS London. Tuve la suerte de tener coaches como Craig Larman y Godjko Adzic, del que aprendí la práctica de specification by example hoy conocida. Desde entonces he intentado aplicarla en todos los equipos que he llevado e intento implementarlo ahora en los equipos a los que asisito como Coach.\r\nMi charla intenta ver esta práctica desde el punto de vista de cómo puede llegar a mejorar la comunicación incluso si después no acaba aplicandose BDD\r\nPara la charla sólo necesito un proyector y pantalla. Puede ser en inglés o en castellano.","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Gerardo Ponte","email":"gponte@bbva.com","avatar":"https://secure.gravatar.com/avatar/59f6259b0e9f1083a972078f0158acf8?s=500","location":"Unknown","bio":"Desde octubre del 2015 soy el responsable de la práctica Agile del proyecto BBVA Banca Digital España, ejerciendo el rol de product owner del Agile Team, compuesto por coaches y scrum masters del proyecto.\r\n\r\nLlevo embarcado en el proyecto Banca Digital España de BBVA desde su inicio hace dos años, colaborando durante el primer año como scrum master de uno de los equipos de desarrollo funcional. En base a la experiencia adquirida ese primer año participé en la CAS 2015 con una charla titulada “Persuading the business guys“.\r\n\r\nSoy miembro activo de la comunidad de Madriagil, con un especial interés por todo lo relacionado con el escalado de estas metodologías.\r\n\r\nPor lo demás, y en lo que respecta a mi trayectoria profesional anterior, tengo más de 25 años de experiencia en IT dentro del sector financiero. Puedes ver el detalle en el enlace a linkedin.","twitter":"","url":"http://linkedin.com/in/GPonte","organization":"BBVA","shirt_size":"Men's M","title":"El backlog del equipo de transformación","abstract":"En un proyecto con más de 35 equipos y más de 500 personas, mantener la pasión que exige la implantación de metodologías Agile requiere del liderazgo de un equipo de coaching, con un modelo de trabajo y unos objetivos muy claros. Conoce el backlog de este equipo en el proyecto de Banca Digital BBVA.","description":"*\"La revolución de las pequeñas cosas\"* es seguramente el producto del proyecto **Banca Digital España** de BBVA más conocido por el público general gracias a su presencia en los medios. Este proyecto comenzó con unas 150 personas y unos 10 equipos de desarrollo, siguiendo inicialmente las directrices del marco de escalado de SAFe 3.0, pero ha ido creciendo durante sus dos años de vida hasta superar los **500 colaboradores agrupados en más de 35 equipos de desarrollo**. Esto ha implicado complicadas planificaciones trimestrales con cientos de dependencias entre los equipos y, sin embargo, un volumen de entregas trimestrales **por encima del 80% de los compromisos adquiridos** y un nivel cada vez más alto de cohesión y velocidad.\r\n\r\nUno de los pilares del éxito de esta transformación ha sido, sin duda alguna, **el trabajo coordinado de un equipo de Agile coaches**. Con mucho cariño y dedicación este equipo ha ido formando y preparando paso a paso a todos los integrantes del proyecto: desde los desarrolladores y analistas hasta los Portfolio Managers, pasando por los Program Managers, Product Owners y, ¡cómo no!, los Scrum Masters.\r\n\r\nComo todos sabemos, cada iniciativa de transformación cultural es un reto en sí misma, pero si además se trata de un cambio masivo hacia metodologías ágiles en una gran empresa, seguramente el reto es todavía mayor. Así que... **¡qué mejor forma de llevar a cabo esa transformación que aplicando precisamente esas misma metodologías!**: visualizar un roadmap para el cambio, descomponer el objetivo final en épicas o capacidades, dividir a su vez esas capacidades en historias de usuario, y lanzar iteraciones con esas historias para ir alcanzando objetivos a corto plazo. Es decir, **construyendo y ejecutando un backlog para asegurar que el cambio se produce de manera iterativa e incremental**.\r\n\r\nEn esta charla podrás conocer de primera mano **en qué han consistido esas épicas y esas historias, cómo se han puesto en marcha, cómo se han ido midiendo los resultados, y qué ha ido bien y qué no tanto...*** En definitiva, todo un *modelo de transformación Agile* hacia un marco de trabajo Agile en escalado.\r\n\r\n¡No te la puedes perder!\r\n\r\n\r\n\r\n\r\n\r\nMás información sobre el proyecto de BBVA Banca Digital España:\r\n*Este proyecto se lanzó en 2014 con el objetivo de mejorar y activar significativamente la oferta de productos y servicios del banco a través de los canales web y móvil. Hasta la fecha ha permitido el desarrollo e implantación, entre otras, de funcionalidades tan relevantes en esos canales como:*\r\n\r\n     - alta de nuevos clientes\r\n     - chat de conversaciones y cita previa con tu gestor comercial\r\n     - firma remota de órdenes y contratos\r\n     - activación y desactivación temporal de las tarjetas\r\n     - modificación de límites de las tarjetas\r\n     - categorización de ingresos y gastos\r\n     - fijación de metas de ahorro\r\n     - ayuda a la decisión en la compra de vivienda (BBVA Valora)\r\n     - domiciliación o pago de recibos\r\n     - solicitud de turno de caja en la oficina\r\n     - Bizum (pagos directos entre particulares)\r\n     - contratación de productos (cuentas, tarjetas, depósitos, fondos, planes, etc.)\r\n     - Smartpay (TPV portátil con el móvil)\r\n     - simulación de seguros de auto\r\n     - pagos de impuestos estatales\r\n     - etc.","notes":"Sobre la charla:\r\n----------------------\r\nLa charla no es nada teórica y se centra en el caso práctico del planteamiento y evolución de la transformación metodológica de nuestro proyecto: desde el arranque en modo big-bang con inspiración en SAFe 3.0, hasta la situación actual con un modelo que nosotros denominamos *BlueSAFe*. Es decir, **la transición desde el modelo teórico que ofrece SAFe hasta su implantación y consolidación en un entorno real**.\r\n\r\nComenzaré con un **breve recorrido por los inicios del proyecto** (creación de equipos y programas, formación y coaching, preparación y lanzamiento de iteraciones, etc.) junto con una evaluación de los resultados obtenidos a partir de los primeros meses.\r\n\r\nA continuación explicaré el planteamiento de afianzamiento y mejora continua realizado a partir del primer año: refundación del **Agile Team**, elaboración del **backlog de transformación**, establecimiento de objetivos trimestrales coincidiendo con las iteraciones de Product Increment (como mejoras en predictibilidad y polivalencia, cumplimiento DoR y DoD, etc.), ejecución de las historias y resultados obtenidos.\r\n\r\nEntraré a nivel de detalle en aspectos prácticos como las __*épicas* e *historias* de nuestro backlog__:\r\n\r\n+ *Knowledge Workers*: historias orientadas a compartir el conocimiento y la experiencia entre las personas\r\n+ *Excelencia en los Equipos*: historias que se desarrollan para mejorar el rendimiento de los equipos\r\n+ *Cohesión en los Programas*: historias que se desarrollan para fomentar el sentido de pertenencia a un programa, y mejorar la colaboración en todos los sentidos entre los equipos scrum que componen cada programa\r\n+ *Portfolio, un equipo auto-organizado*: historias para cohesionar el equipo de Portfolio y Program Managers y fomentar su organización colaborativa\r\n+ *Ceremonias del proyecto*: historias para la organización logística y la ejecución de las ceremonias de Portfolio\r\n+ *Gestión de la herramientas*: historias para la configuración y explotación de las herramientas de soporte (Jira)\r\n\r\n\r\nY finalizaré con una exposición de lo que a nuestro entender han sido las **mejores prácticas**, así como aquellas experiencias que resultaron fallidas pero de las que siempre hemos aprendido cómo seguir mejorando.\r\n\r\n\r\nSobre [mí](https://www.linkedin.com/in/gponte):\r\n----------------------------------------------------------------------\r\nDesde octubre del 2015 soy el **responsable de la práctica Agile** del proyecto BBVA Banca Digital España, ejerciendo el rol de product owner del Agile Team (compuesto por coaches y scrum masters del proyecto) cuya labor es precisamente objeto de mi charla.\r\n\r\nLlevo embarcado en el proyecto desde su inicio hace dos años, colaborando durante el primer año como scrum master de uno de los equipos de desarrollo funcional. En base a la experiencia adquirida ese primer año **participé en la CAS 2015 con una charla titulada \"_Persuading the business guys_\"** (por cierto, que mi charla puede ser en castellano o en inglés).\r\n\r\nAunque anteriormente ya había tenido algún contacto con metodologías ágiles, este proyecto ha supuesto para mí una increíble experiencia de inmersión y aprendizaje que me encantaría compartir con esta charla.\r\n\r\nSoy miembro activo de la comunidad de Madriagil, con un especial interés por todo lo relacionado con el escalado de estas metodologías.","audience_level":"All","tag_list":["change management","scaling","culture","success cases","agile management"],"rating":0.0},{"name":"Marta San Martin","email":"marta.san.martin@gmail.com","avatar":"https://secure.gravatar.com/avatar/150388ee125717a1b45b35187bb7a1b9?s=500","location":"Unknown","bio":"* Team Coach desde hace más de 15 años \r\n* Agile Coach desde hace más de 6 años\r\n* Coach certificado por la International Coaching Federation\r\n* ORSC(Organizational \u0026 Relational System Coaching) Coach (http://www.crrglobal.com/orsc.html)\r\n* SAFe 4.0 SPC\r\n* Apasionada de todo aquello que nos hace más felices en el trabajo como individuos y como equipos, y por tanto más productivos, ","twitter":"MartaSanMartin","url":"","organization":"Kairos Digital Solutions","shirt_size":"Women's M","title":"Feedback positivo, peloteo, feedback negativo, cabreo","abstract":"¿De qué sirve el feedback realmente en los equipos?¿No somos ya mayorcitos para que nos den palmaditas en la espalda?¿Y quién eres tú para decirme cómo tengo que hacer mi trabajo? La ausencia de feedback, el gran obstáculo en la autoorganización, el rendimiento y la mejora continua en los equipos.","description":"* Hablaremos y experimentaremos mediante una curiosa dinámica porqué es importante el feedback y como impacta al rendimiento y buen funcionamiento del equipo\r\n* Los estudios demuestran que un equipo de alto rendimiento se da 5 veces más feedback positivo que negativo\r\n* ¿Cual es la enorme diferencia entre un buen feedback y una gran cagada? Explicaremos los pasos que debe seguir un buen feedback, basados en el lenguaje jirafa. La archi-conocida técnica del sandwich: feedback positivo, feedback negativo, feedback positivo sólo nos mosquea cuando alguien nos dice algo bueno, y nos preparamos para recibir la colleja...\r\n","notes":"* Team coach desde hace más de 15 años, ayudando a los equipos a autoorganizarse y a alcanzar su máximo rendimiento\r\n* Coach certificado por la International Coaching Federation\r\n* ORSC(Organizational \u0026 Relational System Coaching) Coach http://www.crrglobal.com/orsc.html\r\n* Autoformación intensiva en inteligencia emocional","audience_level":"All","tag_list":["facilitation","psychology","teams","performance"],"rating":0.0},{"name":"Eloy García-Borreguero ","email":"eloygbm@gmail.com","avatar":"https://secure.gravatar.com/avatar/5213c7847b530c981515c8a4d4528701?s=500","location":"Bilbao","bio":"Ingeniero informático. Trabajando desde siempre en consultoría.\r\nEscapo del mundo de la consultoría. Al mundo del Software Libre.\r\nMás tarde implicado desde el inicio en la creación de la startup Ticketbis como CTO, desde levantar servidores, a comprar portátiles. Pero sobre todo a intentar formar un buen equipo.\r\n\r\nTras más de seis años, más de 400 empleados y más de 100 millones de euros de facturación, la empresa es adquirida por eBay-Stubhub.\r\n\r\n\r\n\r\n","twitter":"eloygbm","url":"http://blog.engineering.ticketbis.com","organization":"Ticketbis - Stubhub ","shirt_size":"Men's L","title":"¿Organización ágil? Caso ticketbis ","abstract":"Ticketbis ha crecido de 2 a 40 personas en el equipo técnico y a 400 en toda la empresa.\n\n¿Cómo nos hemos organizado en el departamento de Tecnología? \n\nHablaremos desde la práctica y sin hacer mucho caso a la teoría. \n\nUna historia real de desarrollo de software y organización de equipos. \n","description":"De la mano de un negocio que crece de forma vertiginosa , va creciendo a la vez un departamento de Tecnología para dar respuesta a dicho negocio.\r\n\r\nEquipos multidisciplinares, departamentos deslocalizados, problemas de comunicación y de alineamiento, organización vs flexibilidad,... Todo ello para convertirnos en parte de una multinacional como eBay.\r\n\r\nUna historia real sobre crecimiento de equipos y de empresas, sin mucha teoría pero con un par de ideas claras. \r\n\r\nQué más poner en la descripción..., todos sabemos que las charlas más interesantes son las de historias reales ;) \r\n\r\n\r\n","notes":"Empecé en ticketbis desde el principio. El primer empleado de la compañía.\r\nDesde entonces he vivido (yo y unos cuantos más) desde dentro un crecimiento rapidísimo como empresa. ","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Florentino Romero Haro","email":"fromeroharo@gmail.com","avatar":"https://secure.gravatar.com/avatar/aa352a29abbd4e8788005b725d54605c?s=500","location":"Unknown","bio":"Acompaño a personas de grandes organizaciones en sus cambios colaborando con ellas en la introducción de diferentes formas de trabajo colaborativas y de aprendizaje continuo, preocupándome por cómo las personas perciben el cambio y ayudando en su ámbito emocional, cognitivo y de comportamiento para una mejor adaptación.\r\n\r\nÚltimamente estoy enamorado del marketing, dbm y el trading, que espero incorporar a mi manera de ser en mi día a día, experimentando nuevas formas de ver el mundo y de poder compartir mi identidad. \r\n\r\nEl cambio comienza desde uno mismo, ... ¿desde dónde sino?","twitter":"worldintino","url":"","organization":"ThinkingWithYou","shirt_size":"Men's L","title":"Modelo DIAS: genera Autonomía en la persona y en los equipos","abstract":"Cuándo cerrar tu paso por un equipo, cuándo ser un ejemplo para alguien que te rodea, cuándo cofacilitar, ...\n\nDIAS - Descubrimiento, Inmersión, Acompañamiento y Supervisión son los 4 pasos necesarios para hacer evolucionar las relaciones hacia la autonomía y un mejor desarrollo personal.","description":"El modelo DIAS surge como una nueva forma de visualizar las iniciativas dónde estamos involucrados en base al grado de autonomía de las mismas, olvidando los TODO-DOING-DONE y hablando de fases de relación. Me permite entender de primera mano qué tipo de liderazgo debo aplicar en cada situación de manera predominante y me marca los pasos para poder llevar las relaciones a otro punto. También de manera rápida puedo posicionarme en una fase u otra en mis conversaciones \"seguimos en inmersión y necesito desarrollar un poco más esta habilidad para poder hacer XX solo\", \"en la próxima sesión nos repartimos las dinámicas - Acompañamiento\", \"he facilitado y necesito más formación y que me muestres más esta parte u otra - Inmersión\", \"no tenemos claridad sobre la necesidad- no tenemos dirección- ni objetivo- Descubrimiento\". \r\n\r\nEs un modelo muy simple y natural, entendiendo de primera mano en qué consiste cada apartado y la necesidad de marcar una serie de pautas para la autonomía.  Al ser un modelo de Relación, se realiza siempre entre dos partes involucradas, generando así diferentes vistas: PERSONA, EQUIPO, INICIATIVA (proyecto-producto), PORTFOLIO, que podemos emplear en los diferentes contextos de nuestro trabajo.\r\n\r\nEn esta charla se ofrecerá a los asistentes las plantillas empleadas en el modelo y se mostrarán ejemplos prácticos de aplicación, así como tableros de uso y su aplicación en el cambio organizacional. Tanto si el formato es charla de 45 minutos o taller de 1 hora, se intentará sentar las bases para que los asistentes salgan de la sesión con la idea de cómo emplearlo en el ámbito de Persona, Equipo, Iniciativa, Portfolio. ","notes":"Es un modelo propio que he generado en base a la necesidad de un equipo de coaches para poder tener claro en qué estado se encontraban las personas y equipos que acompañamos. Creo que tiene gran aplicación práctica en las organizaciones y puede ser de valor para los asistentes dándoles un soporte para ayudar a su entorno. No es necesario tener conocimientos de coaching ni ser un experto mentor ni nada, trabajamos desde dónde esté cada uno. \r\n\r\nLlevo trabajando con él más de 1 año y estoy preparando un pequeño paper para poder difundirlo. \r\n\r\nPara una mejor revisión puedo enviaros las plantillas que empleo, también alguna foto de cómo lo estoy empleando ahora mismo en los tableros intentando quitar información \"delicada\". \r\n\r\nTanto si el formato es taller como charla puedo enforcarlo de manera práctica. No puedo ajustarme a una charla rápida de 15 minutos debido a que me gustaría que los asistentes se llevaran una herramienta práctica de uso y necesito un mínimo de explicación y de experimentación. Mínimo 45 min, si lo veis interesante y queréis alargarlo, puedo ocupar el hueco que me asignéis.\r\n\r\nMuchas gracias y mucho ánimo con la CAS","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Fernando Palomo García","email":"fernando.palomo@agilar.org","avatar":"https://secure.gravatar.com/avatar/ae784a655f5dfae4c2977830d64c3c1b?s=500","location":"Unknown","bio":"Agile Coach, Coach de Sistemas Organizacionales y Relaciones, Certified Enterprise Coach by Scrum Alliance. \r\n\r\nAgile Coach en Agilar desde 2012, donde ayudo a organizaciones de diversas naturalezas e industrias a superarse a sí mismas y establecer mejores métodos organizativos para mejorar el resultado de sus productos. \r\nProfesor invitado en diversos programas Master de la UPC y en el Máster en Metodologías Ágiles de La Salle. Anteriormente CTO en diversas empresas como Groupalia.com, Splendia.com, MyBrands.de o In Store Solutions (Skype e-commerce), donde hemos adoptado XP, Scrum y hemos desarrollado sistemas de alta escalabilidad.","twitter":"fpg81","url":"","organization":"Agilar","shirt_size":"Men's XL","title":"Priorizando productos con el Modelo de Kano","abstract":"En esta sesión navegaremos por el modelo de Kano, un método desconocido para muchos y malentendido para otros. Este modelo establece todo un proceso de descripción, análisis y priorización de nuestro producto totalmente de la mano de nuestros usuarios. ","description":"El modelo de Kano es el gran desconocido de las técnicas de priorización de producto. Con una fuerte orientación hacia el usuario, no solo navegaremos por las categorías para describir funcionalidades sino que profundizaremos en el proceso de captura de feedback del usuario y análisis de los datos de cara a decidir nuestra priorización y nuestro product roadmap. \r\nAún habiendo sido creado en los años 80, el modelo de Kano se erige como un método estructurado de priorización, como parte esencial para organizaciones del siglo 21, donde la habilidad de experimentar rápidamente y analizar el feedback de los usuarios está por encima de los grandes gurús de producto que conocen lo que los usuarios quieren. \r\n","notes":"La idea es una breve exposición del método, el modelo con sus tres pasos: categorías de funcionalidades, encuesta y análisis de la encuesta.","audience_level":"All","tag_list":["tools","innovation","lean startup","product discovery"],"rating":50.0},{"name":"Rubén Eguiluz, Alberto Pérez, Isidro López","email":"bifer@alea-soluciones.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/5740/Alea.png","location":"Madrid","bio":"Somos una representación del equipo de desarrollo de Alea. \r\n\r\nDisfrutamos de nuestro trabajo y de nuestra profesión. Somos conscientes de nuestro valor, nos involucramos en el negocio para el que trabajamos. Hacemos preguntas y entendemos el valor que aportamos con nuestro trabajo. ¿Por qué es importante lo que estamos programando? ¿Cómo utilizan nuestro software? ¿cuándo? ¿quién? ¿por qué?, son algunas de las preguntas que nos solemos hacer habitualmente.\r\n\r\nBuscamos sentirnos orgullosos de lo que hacemos, de cómo lo hacemos y si de paso nos divertimos en el proceso, mucho mejor. Pensamos que lo importante son los valores, la cultura y el equipo y que todo lo demás emerge de una relación sana y un equipo alineado.\r\n\r\nRespecto a One Direction... nosotros es que somos más de Fifth Harmony :-p","twitter":"AleaSolucionesS","url":"https://github.com/aleasoluciones","organization":"Alea Soluciones, S.L.","shirt_size":"Men's L","title":"Alineando valores y principios con prácticas técnicas","abstract":"Seguro que tu empresa cuenta con una fantástica lista de valores corporativos. Ahora bien, ¿cómo enganchan esos valores con cuestiones como las prácticas técnicas, desarrollo de producto o la organización de equipos?\nQueremos compartir cómo lo llevamos a cabo, con nuestros éxitos y fracasos.","description":"Empatía. Colaboración. Confianza. Respeto. Transparencia.\r\n\r\nEsos son nuestros valores en el equipo de desarrollo de Alea. Crear esta lista de valores es fácil, seguramente tu empresa o tu equipo tambien la tiene. Sin embargo, ¿cómo traducimos estos valores al día a día? ¿Cómo hacemos para que exista coherencia entre estos valores y la cultura “real” de la empresa?\r\n\r\nEn Alea hemos construido una cultura basada en \"modern XP\"  (**XP** y **Lean**) con la que aportar valor a la empresa desde la coherencia con dichos valores.\r\n\r\nEn esta charla queremos compartir desde cómo se decide qué necesidades de negocio atender, a por qué y cómo con prácticas técnicas como TDD o el pair/mob programming aportamos valor REAL a la empresa.\r\n\r\nOs contaremos cómo nos organizamos para huir de los típicos silos de conocimiento y así reducir el mítico bus-factor, o a través de qué mecanismos buscamos la mejora continua.\r\n\r\nComo no todo son unicornios trotando, también abordaremos aquellas cuestiones que no han funcionado tan bien o algunas posibles áreas de mejora en la actualidad.","notes":"En Alea llevamos ya muchos años siguiendo los valores y prácticas XP, así como diversos principios Lean. \r\n\r\nAl mismo tiempo, la empresa va viento en popa y negocio está muy satisfecho con los resultados y confía plenamente en nosotros, lo cual demuestra que realmente funciona y qué prácticas técnicas como TDD o pair/mob programming son compatibles con la rentabilidad económica de la empresa.","audience_level":"Intermediate","tag_list":[],"rating":100.0},{"name":"Andrés González Fernández","email":"andres.gonzalez79@gmail.com","avatar":"https://secure.gravatar.com/avatar/04df0be79e6eda295606283a5ac93b08?s=500","location":"Madrid, Spain","bio":"Diseñador de Experiencia de Usuario en Kaleidos y formador de diseño de interacción en La Nave Nodriza. \r\n\r\nLicenciado en Bellas Artes, Máster en Artes Digitales y formado en Diseño de Producto Digital, Andrés tiene una amplia experiencia definiendo y diseñando productos digitales en grandes y pequeñas organizaciones, tanto en agencia como integrado equipos de producto. \r\n\r\nEntre sus principales intereses de los últimos años están el cómo integrar procesos de UX y diseño en entornos de desarrollo ágil, la relación entre diseño y Open Source o la búsqueda de soluciones tecnológicas para procesos de democracia participativa.","twitter":"myfunnyandy","url":"","organization":"Kaleidos Open Source","shirt_size":"Men's XL","title":"Definiendo el Mínimo Producto Valioso","abstract":"¿Cómo debe ser el Mínimo Producto Valioso? ¿Cuál es la forma de definirlo? En esta charla se indagará, desde la perspectiva del diseño de experiencia de usuario, en problemáticas y métodos para definir no sólo “la cosa correcta” sino “la cosa valiosa” a construir. ","description":"En el panorama actual del desarrollo de productos digitales es ampliamente aceptada la idea de que hay que empezar por lo que se conoce por Mínimo Producto Viable (MVP). Sin embargo, a pesar del aparente consenso, el alcance del concepto de MVP suele ser tema de discusión cotidiana entre los equipos de desarrollo ágil. La ya no tan reciente integración de los procesos de diseño y UX en marcos de trabajo ágil añade un plus de dificultad (o podríamos decir reto) al combinar definición, diseño y ejecución del MVP en un mismo contexto de trabajo.\r\n\r\n¿Cómo debe ser el MVP de nuestros sueños? ¿Cuál es la forma de definirlo? ¿Quiénes son los agentes implicados? Esta charla trata de explorar, desde la perspectiva del diseño de experiencia de usuario, los problemas a los que nos enfrentamos al definir no sólo “la cosa correcta” sino también “la cosa valiosa” a construir. Indagará en cómo los distintos sesgos y objetivos de los agentes implicados (negocio, diseño/ux y tecnología) afectan a la percepción de lo que debe ser el MVP, hablará de la hipótesis y la Propuesta de Valor, aparecerá alguna pirámide de Maslow gratuita y se recomendarán libros que ayuden a tener si cabe aún más dudas sobre el tema. ","notes":"","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Jerónimo Palacios","email":"giropa832@gmail.com","avatar":"https://secure.gravatar.com/avatar/ca4ff0cd69578429016d11d351ec8805?s=500","location":"Berlin, Germany","bio":"Jerónimo is a Scrum.org's Professional Scrum Trainer (PST), Lean Kanban Accredited Trainer (AKT), an Agile Coach and an international speaker. He supports small \u0026 large organisations transition from process-centric to value-centric systems, working at strategic level with top management and C-execs as well as functional teams to make transformations happen using frameworks like Nexus and SAFe.\r\n\r\nHe focuses on people, energising organisations by pointing to barriers in communication while supporting individuals to create new ways of working as the key factor to sparking cultural change. He has a proven track record of successes in Banking \u0026 Finance, Startups, Telco, Government \u0026 Technology and owns a portfolio of techniques and frameworks to achieve these aspirations, that include Scrum, Lean, Kanban, Scrumban, Continuous Integration and Continuous delivery, Lean startup, User Story Mapping, Agile portfolio \u0026 release mapping. \r\n\r\nHe has a solid technical background that encompasses Software Development, DevOps and Product Management; has served as Scrum Master \u0026 Product Owner","twitter":"giropa832","url":"http://jeronimopalacios.com","organization":"Scrum.org","shirt_size":"Men's 3XL","title":"El método Kanban, mucho más que un tablero","abstract":"Cuando hablamos de Kanban, la mayoría de las organizaciones y profesionales que hacen agilidad entienden la existencia de un \"Tablero\". Sin embargo, el método Kanban es mucho más. Límites WIP, Políticas, Feedback Loops o clases de servicio. Durante esta charla repasaremos las claves del método. ","description":"Kanban, tal y cómo lo conocemos hoy, ha sido una evolución principalmente dirigida por David J. Anderson hacia un método más completo y holístico que trae los principios de Lean al mundo del conocimiento. Cómo ya pasara con Scrum hace unos años, hoy los detalles de Kanban son desconocidos para la mayoría de las organizaciones que lo han implementado. \r\n\r\nLa charla se divide en tres secciones: \r\n\r\n*Entendiendo Kanban: Tableros, tarjetas y sistemas*\r\n\r\nPara empezar a hablar con propiedad, hay que entender de donde viene el término Kanban y a que distintos elementos se aplica. Cuando hablamos de implementar Kanban, tenemos que clarificar de qué estamos hablando. ¿Tablero, slots, método o sistemas?\r\n\r\n¿Hablamos de implementar Kanban (看板), un tablero donde mostramos el trabajo -o cualquier otra cosa-.?\r\n¿Hablamos de implementar Kanbans que son señales visuales que nos indican algo, por ejemplo el número de clientes con el número de prendas en el probador?\r\n¿O hablamos de implementar el método Kanban, que acoge a los dos anteriores y además incluye una serie de prácticas para mejorar la gestión del flujo de trabajo? Eso da lugar a un sistema Kanban, que entraría dentro de los métodos ágiles.\r\n\r\nUn tablero Kanban o el uso de kanbans no se consideran un método ágil, aunque muchos de ellos los utilizan. Son solamente técnicas.\r\n\r\n*Límites WIP, Políticas y Clases de Servicio*\r\n\r\nHay un primer elemento necesario del método Kanban: Los límites del trabajo en curso. Los WIPs nos van a indicar cual es el número máximo de elementos en los que podemos trabajar en un momento dado. Esto favorece varias cosas: Por un lado, introduce una restricción en el sistema, no podemos tener trabajo infinito y nos permite medir; por otro, mejora el foco del trabajo que estamos haciendo. Nos centramos en terminar el trabajo empezado en lugar de seguir empezando trabajo. El tercer factor es que mejora el ratio de entrega.\r\n\r\nOtra práctica imprescindible del método Kanban es hacer explícitas -transparentes- las políticas del sistema. ¿Quien es el responsable de mover los elementos de trabajo? ¿Cuando se revisa el tablero? ¿Cuales son las reglas para cambiar el sistema?\r\n\r\nLas clases de servicio son una clasificación de los posibles ítems de trabajo que pueden surgir. La práctica es identificar aquellos ítems que sean más críticos basados en su Cost of Delay. El Cost of Delay significa: ¿Cuanto me costaría si este ítem que tengo que entregar en esta fecha estuviera retrasado? La razón de tener clases de servicio es que no todos los ítems de trabajo tienen que estar en fecha.\r\n\r\n*Reuniones y roles*\r\n\r\nDesde 2008, Kanban ha evolucionado positivamente para crear un método que pretende dar soluciones a establecer un sistema que permita gestionar el flujo de trabajo en una organización, permitiendo un estado de auto-organización que de respuestas a la complejidad creciente, especialmente en entornos de desarrollo de software.\r\n\r\nPara ello, además de los tableros kanban, junto con las políticas, límites WIP y clases de servicio, existen una serie de roles y reuniones que pueden ser adoptados en Kanban.\r\n\r\nKanban, a diferencia de Scrum, no prescribe roles o reuniones. Éstos han sido destilados a partir de la observación en organizaciones que han adoptado el método y lo han evolucionado de forma colaborativa.","notes":"","audience_level":"Beginner","tag_list":[],"rating":100.0},{"name":"Enrique Morey Matos","email":"emorey.nextel@gmail.com","avatar":"https://secure.gravatar.com/avatar/d8a7e040b6c1ce8e5c1f0d7fddaa5274?s=500","location":"Zamudio - Bizkaia","bio":"Director de proyectos y servicios en el ámbito de las tecnologías de la información (TI), con 20 años de experiencia definiendo estrategias para la implementación de sistemas de información, y desarrollando proyectos tecnológicos de soporte al negocio en el sector bancario, gobierno y TI.\r\n\r\nEspecialista en conceptos y prácticas para la gestión, desarrollo y operación de servicios TI, certificado como ITIL Expert por Axelos Global Best Practice. SCAMPI Lead Appraiser certificado por el CMMI Institute para la evaluación de procesos para el establecimiento y la entrega de servicios.\r\n\r\nMáster en Administración de Negocios por ESADE Business School de Barcelona (España) e Ingeniero Informático por la Pontificia Universidad Católica del Perú (PUCP). Presencia internacional y conocimiento del mercado latinoamericano, implantando soluciones en países como España, Portugal, México, Perú, Colombia, Brasil y Argentina. Profesor de la Maestría de Informática de la PUCP y ponente invitado en diversas instituciones y congresos.","twitter":"NextelSA","url":"http://www.nextel.es","organization":"Nextel S.A.","shirt_size":"Men's XL","title":"“Mezclado, no agitado”: Agilidad para ISO 20000","abstract":"Un enfoque para la implementación de un Sistema de Gestión de Servicios, basado en la norma ISO 20K, que usa prácticas y técnicas ágiles. Se apoya en la propuesta a dos velocidades de la estrategia TI bimodal de Gartner, identificando los procesos más proclives a ser implantados con métodos ágiles.","description":"Desde su aparición, a principios del nuevo milenio, las metodologías ágiles han difundido sus propuestas con mucho éxito, consolidando, a día de hoy, un puesto de vanguardia frente a los métodos tradicionales que durante años dominaron el sector de las tecnologías de información. Si bien estas prácticas ágiles nacieron en el ámbito del desarrollo de software, actualmente su influencia abarca también a otras disciplinas tecnológicas.\r\n\r\nEn el marco de la gestión de los servicios TI (ITSM), conceptos como DevOps -para la administración ágil de sistemas- o la estrategia TI bimodal -propuesta por Gartner para el enfoque a dos velocidades- son tecnologías que en los últimos meses se han posicionado en lo más alto de las expectativas de los usuarios.\r\n\r\nEsta ponencia presenta una aproximación a la implementación de un sistema de gestión de servicios basado en la norma internacional ISO 20000, haciendo uso de prácticas y técnicas ágiles. Apoyándose en la estrategia de las dos velocidades, se plantea un escenario en la que se identifican los procesos más proclives a ser implantados mediante métodos ágiles, y otros en los que, por su naturaleza, es más recomendable un enfoque más secuencial, como el modelo en cascada.\r\n\r\nPara ejemplificar la aplicación de estas prácticas ágiles en el contexto de la norma ISO 20000, se revisará el proceso Gestión de Problemas para mostrar la utilidad de las historias de usuarios, los ciclos sprint y los tableros Kanban en el desarrollo y la ejecución del proceso.","notes":"Agenda de la presentación:\r\n\r\n1.\tIntroducción: madurez y expectativas en el mundo ITSM.\r\n2.\tSamuráis vs. Ninjas.\r\n3.\tMaratonistas vs. Velocistas.\r\n4.\tEl Manifiesto Ágil.\r\n5.\tLa norma ISO 20000:2011.\r\n6.\tProcesos ISO 20000 más ágiles y más tradicionales.\r\n7.\tEjemplo: Gestión de Problemas con prácticas ágiles.\r\n\ta)\tRoles.\r\n\tb)\tHistorias de usuario.\r\n\tc)\tPriorización.\r\n\td)\tCiclo iterativo.\r\n\te)\tRetrospectiva.\r\n\tf)\tTablero Kanban.\r\n8.\tEjemplo Scrum de Scrums: Gestión de Cambios.\r\n9.\tConclusiones.","audience_level":"Intermediate","tag_list":[],"rating":0.0},{"name":"Fatma Urek","email":"furek@thoughtworks.com","avatar":"https://secure.gravatar.com/avatar/1c120a50602a705b42892e1dea5dbf7d?s=500","location":"Unknown","bio":"I am graduated from Computer Engineering department of Middle East Technical University.\r\n\r\nAfter graduation; I worked as a developer for 4 years then I became a BA and currently working as a Business Analyst at ThoughtWorks Turkey. I am also so interested in Lean Enterprise, Design Thinking and UX activities. \r\n\r\nGladly, I am the organizator of 2 volunteer communities at Istanbul; Business Analysis Istanbul and Design Thinking Turkey. I am also the organizator of Open Ideo Istanbul Chapter.","twitter":"fatmaurek","url":"","organization":"Thoughtworks Turkey","shirt_size":"Women's M","title":"User-Oriented Analysis and Design at Agile","abstract":"Despite of old fashioned business focused analysis rituels, today technology is built in the light of user experience. Thereby, requirement analysis approach and practices are evolving; only with BA and UX collaborated agile practices would provide better user experience to your product.","description":"Why User-Oriented design? \r\n\r\nDespite of old fashioned business focused analysis rituels, today technology is built in the light of user experience. Thereby, requirement analysis approach and practices are evolving; user requirements overtake business requirements. In this new world, Business Analysts are not enough to gathering all user and business centric requirements and the only way of success is collaborative work of business analysts and user experience designers. \r\n\r\nAnd how?\r\nThere are a lot of user-centric analysis practices for agile development teams, for every phase of the project.\r\n - The first phase is discovery, which aims to understand the customer and user opportunity. Most user requirement analysis and user research facilities are done at this phase, to be sure selecting the best solution or best idea to move on.\r\n - The second phase is inception; this phase is dedicated to defining product in the context of user and business. So business vision and user modelling activities are vital at this phase, only then user workflow and user stories could be generated. And finally a project plan comes out.\r\n - During development of project; design - build - test - refine cycle is constant for every each iteration. Solution improvement according to user tests is the most important aim of this cyclic working style.\r\n\r\nTo conclude;\r\nUser experience is at every minute of our life, also at technology. With user-oriented agile practices, it is possible to have better user experience at our projects.\r\n\r\n\r\n","notes":"I am an ex-developer and currently working as a business analyst at ThoughtWorks Turkey. I am also so interested in design thinking and ux activities. \r\n\r\nGladly, I am the organizator of 2 volunteer communities at Istanbul; Business Analysis Istanbul and Design Thinking Turkey. This year I had 2 presentations and 1 workshop at these communities. At the end of this month, I will present \"Value Driven Analysis at Inception Phase of Projects\" at a university symposium (http://uyms.comu.edu.tr/).\r\n\r\nI am also the organizator of Open Ideo Istanbul Chapter, working on the first challenge of our brand-new chapter.","audience_level":"Intermediate","tag_list":[],"rating":0.0},{"name":"Antonio de la Torre","email":"antondelatorre@gmail.com","avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/5826/antonio-profile-aos-jul-2016.jpg","location":"Oviedo, España","bio":"Developer and Agile Instigator at Codesai, a well-crafted software development company\r\n\r\nEducated as Computer Scientist. After several positions in top IT companies, he found his place amongst professionals not interested in their role in the company but in creating beautiful code.\r\n\r\nToday, still wanted by the market, he survives as a coder-soldier of fortune. In his free time he dreams about XP values rules the world and the best integration of all profiles in the development A-team, especially BA-style designers.\r\n\r\n--\r\nDesarrollador e instigador agile en Codesai, una empresa de desarrollo de software bien hecho.\r\n\r\nDespués de pasar por varias compañías de IT, encontró su sitio entre los profesionales que están más interesados en hacer un código bonito que en su carrera en la empresa. \r\nEn su tiempo libre sueña con que los valores XP gobiernen el mundo y la mejor integración posible de todos los perfiles en el desarrollo del producto,  especialmente los de diseño.\r\n","twitter":"adelatorrefoss","url":"https://about.me/adelatorrefoss","organization":"Codesai","shirt_size":"Men's M","title":"CAS2016 Abstract Needs vs Solutions - Necesidades vs Soluciones","abstract":"Veremos el Crossing the Chasm vitamitado que Chris Matts presentó en la ALE2015, que nos revela que los problemas a los que nos enfrentamos pueden ser basados en Necesidades o aplicar Soluciones, podemos Principios o aplicar Prácticas. ¿Hay que elegir? ¿Son compatibles? ¿Son realmente diferentes?","description":"En agosto de 2015 estuve en Sofía asistiendo a la ALE[1] y conocí al genial Chris Matts que ejecutó la keynote inaugural. Nos presentó una aproximación al clásico Crossing the Chasm, mapeándolo por encima con otros modelos como el Cynevin, Meme Lifecycle o Real Options.\r\n\r\nFue realmente revelador. Comprender que existen dos tipos de problemas a resolver, dos tipos de inquietudes.\r\n\r\n¿Por qué algunos se conforman con una solución suficientemente buena y otros buscan continuamente la mejor solución? ¿Por qué las buenas prácticas pueden ser no tan buenas? ¿Por qué reinventar continuamente la rueda? ¿Qué motivaciones existen en unos y otros?\r\n\r\n¿Dónde te ves tú?\r\n\r\nEn esta charla explicaremos este modelo en el que se describen las diferentes comunidades que tenemos a nuestro alrededor y veremos si es posible alinearlas ante un objetivo común con tiempo para poder compartir luego vuestras impresiones.\r\n\r\nArtículos relacionados de Chris Matts: \"Communities of Need \u0026 Community of Solutions\"[2] y \"Agile – The Broken Learning Machine\"[3]\r\n\r\n[1] http://ale2015.eu \r\n[2] https://theitriskmanager.wordpress.com/2015/04/19/communities-of-need-community-of-solutions/ \r\n[3] https://theitriskmanager.wordpress.com/2015/05/05/agile-the-broken-learning-machine/\r\n","notes":"Esta charla la he dado en @madriagil y en la Software Craftsmanship de Pamplona con muy buen feedback. Creo sinceramente que es un tema complejo, pero que según se van contando va cogiendo sentido y crea un poso muy potente en la audiencia.\r\nAdemás feedback bueno tanto de gente muy veterana, como por personas nuevas en agile.\r\n\r\nMe baso en dos artículos de Chris Matts, y mi intención es explicar el modelo que ahí plantea y luego trabajar mis propias conclusiones de mi experiencia.\r\n\r\nMe defiendo mejor en español, pero quizás podría hacerla en inglés.\r\n\r\nPongo la bio en inglés y en español.\r\n\r\nGracias!","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Modesto San Juan","email":"modestosja@gmail.com","avatar":"https://secure.gravatar.com/avatar/2f05a996828bee44fa60c6d409a09294?s=500","location":"Unknown","bio":"Soy software craftsman en Codesai. Trabajo ayudando a otras empresas a desarrollar sus productos y a  mejorar sus flujos de trabajo, la calidad de su código y a adoptar prácticas como XP y TDD.","twitter":"msanjuan","url":"http://www.modestosanjuan.com","organization":"Codesai","shirt_size":"Men's S","title":"El camino del aprendizaje","abstract":"Llevas 6 meses con la cabeza metida en un proyecto y han salido 15 nuevos frameworks de javascript. El mundo del desarrollo se mueve a una velocidad que no eres capaz de alcanzar y culpas a tu empresa porque no te forma. ¿Te has planteado cambiar el enfoque?","description":"El desarrollo de software implica aprendizaje constante. Trabajamos con tecnologías que apenas existían hace unos años y no pasa un día sin que aparezcan nuevas. Es un camino sin fin que puede tomarse por muchas vías, tan importante para los profesionales como para las empresas y al que no siempre le prestamos la atención necesaria.\r\nCómo decidimos recorrerlo condiciona nuestro futuro como profesionales y la competitividad de nuestras empresas. Actualmente, en tiempos en los que parte de nuestro sector se cuestiona la utilidad de la universidad en nuestro aprendizaje a la vez que otra parte exige la necesidad de un título como reconocimiento de capacitación, si algo es incuestionable es que dejar de aprender no es una opción.\r\n¿Qué podemos hacer los profesionales?¿Qué pueden hacer por nosotros nuestras empresas?¿Cómo deberíamos trazar nuestro camino? En esta charla profundizaremos sobre ello de la mano de Ronny y Modesto, dos viajeros cuyos caminos se juntaron en un evento de la comunidad.","notes":"La charla la daría con uno de los aprendices de Codesai, Ronny Ancorini.","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Thomas Wallet","email":"twallet@gmail.com","avatar":"https://secure.gravatar.com/avatar/6308e2add9f17e6a6a45cbc8891758f5?s=500","location":"Unknown","bio":"**Thomas Wallet** (Pragmatic \u0026 Slow Agile Broadcaster @[Kleer](http://www.kleer.la))\r\n\r\nCon 15 años de vida en Argentina y múltiples experiencias en desarrollo de software, gestión de proyectos y consultoria, Thomas Wallet sigue su camino, principalmente suramericano, como coach, trainer, speaker y organizador de comunidades y eventos agiles. \r\n\r\n**Su misión**: ayudar a los trabajadores a limpiar sus ecosistemas cuidando y tuneando sus actividades esenciales, eliminando los desperdicios de trabajo acumulados y re-construyendo equipos con sentido.\r\n\r\nBusca y encuentra valor en:\r\n + Empirismo con retrospección\r\n+ Auto-organización con colaboración\r\n+ Transparencia con honestidad y respeto \r\n+ Excelencia con pragmatismo\r\n+ Visión inspiradora con pequeños pasos\r\n\r\nMás sobre Thomas Wallet: [About.me](https://about.me/thomas.wallet) | [Blog: el próximo paso](http://www.elproximopaso.net/) | [Twitter](https://twitter.com/WalletThomas)","twitter":"WalletThomas","url":"http://www.elproximopaso.net","organization":"Kleer","shirt_size":"Men's L","title":"Retrospectivas XXL","abstract":"Los invito a descubrir dinámicas y patrones específicos para grandes retrospectivas. Ofrezco guiarlos en este aprendizaje vivencial y ayudarlos a incorporar herramientas simples y potentes para animarse a organizar Retrospectivas XXL, de alto impacto en las transformaciones organizacionales","description":"Quiero compartir con los participantes unas dinámicas y patrones específicos para la organización de grandes retrospectivas, que involucran a grupos grandes (20 a 200 personas) o en las cuales miramos periodos largos (3 a 12 mes). \r\n\r\nVeo que son pocas las instituciones que organizan y aprovechan bien este tipo de retrospectivas, que tienen cierto grado de complejidad, pero a su vez generan cambios culturales y mejoras que trascienden el ámbito de un simple equipo. Mi hipótesis es que los agilistas quizás no se imaginan el potencial de estas actividades y/o no se animan a diseñar/ejecutarlas. \r\n\r\nQuiero ofrecerles un taller muy vivencial (estructurado \"From the Back\" y basado en \"Art of Hosting\") en el cuál experimenten con distintas dinámicas específicas y muchos patrones prácticos para conocer las grandes retrospectivas y animarse a organizarlas. \r\n\r\nEl taller tiene la siguiente estructura:\r\n\r\n**Bloque 1: Desafíos y Beneficios de las Big Retro**\r\n\r\n* Conexión: Conectarse\r\n* Conceptos: ¿Qué es una retro? ¿Qué es una big retro? ¿Para qué? ¿Cómo?\r\n* Concreción: Grupos de Desafíos y Beneficios\r\n* Conclusiones: Patrones Emergentes (A3, Dividir y Unir)\r\n\r\n**Bloque 2: Memoria Colectiva**\r\n\r\n* Conexión: Recuerdos personales\r\n* Conceptos: Estructurar y Soltar\r\n* Concreción: Big Time Line Comunitarios\r\n* Conclusiones: Patrones Emergentes (Estructura, Time Box, Pinchar)\r\n\r\n**Bloque 3: Ritmo y Facilitación**\r\n\r\n* Conexión: Carrera de tips de facilitación\r\n* Conceptos: Camino y ritmos, Doble diamante de las retros \r\n* Concreción: Visualización y Cambios de Ritmo. Up (2 dinámicas) \u0026 Down (1 dinámica) \r\n* Conclusiones: Patrones Emergentes (Diseño, Visualización, Opciones)\r\n\r\n**Bloque 4: Propósito y Conversaciones Emergentes**\r\n\r\n* Conexión: Mini-circulo\r\n* Conceptos: Círculo \u0026 Propósito\r\n* Concreción: World-Cafe con 2 preguntas\r\n* Conclusiones: Patrones Emergentes (Círculo, Soltar, Entregables, Cosechar, Cross-Polinización) + Dinámica Agradecimientos\r\n\r\nEn cada bloque, documentaremos entre todos los patrones, tips y aprendizajes claves para que todos se puedan llevarlo a modo de resumen concreto del taller. ","notes":"**Requisitos Logísticos: \r\nEl taller dura mínimo 2h. Se requiere un espacio amplio, con posibilidad de pegar papeles en la pared, y de trabajar en grupos de 4-8 personas con mesas y sillas.\r\n\r\n**¿Pór que yo? \r\nDesde hace más de 10 años me apasiono por las retrospectivas, y trato de ayudar a otros a diseñar, facilitar o participar en ellas, y en este camino pude experimentar desde retrospectivas personales hasta retrospectivas muy grandes de hasta 200 personas o de varios días. Me apasiona prender y cultivar la llama de la retrospectiva.","audience_level":"Intermediate","tag_list":[],"rating":0.0},{"name":"Adrian Perreau de Pinninck","email":"adrian.perreau@agilar.org","avatar":"https://secure.gravatar.com/avatar/edec67f70a513e11c8b700afc1bb87d0?s=500","location":"Unknown","bio":"Doctor en Inteligencia Artificial con experiencia en todas las áreas del desarrollo software, desde toma de requisitos a testeo. Ha gestionado proyectos desde investigación aplicada hasta gestión del cambio en grandes empresas. Su misión es desencadenar el potencial creativo de la gente trabajando en equipo. Sus intereses principales son usar métodos Agile para mejorar la productividad de equipos desarrollando productos de tecnología punta y ayudar a empresas en fase de crecimiento a mantenerse innovadoras.\r\n\r\nAdrian dirigió el equipo a cargo de implantar CD en la empresa de IT con mayor crecimiento de Europa. Fue un proyecto de más de un año y un equipo dedicado de 10 ingenieros. El tiempo de ciclo de puesta en producción de las nuevas funcionalidades pasó de 60 a 15 días y los tiempos de merge de 20 días a menos de 1 día.","twitter":"eidrien","url":"http://www.agilar.org","organization":"Agilar","shirt_size":"Men's S","title":"Title: The Economics of Continuous Delivery","abstract":"Los Agilistas sabemos lo potente que es Continuous Delivery (CD) para un equipo Agile. Lo difícil es convencer a dirección del ROI de invertir en CD. Os presentaremos un modelo económico de CD que cuantifica los costes de la integración diferida y deployments manuales, que os ayudará a convencerlos.","description":"¿Por qué deberías invertir en Continuous Delivery?\r\nEs caro, requiere experiencia técnica, requiere tiempo y máquinas…\r\nEl problema es que sin CD, estás andando con un agujero en el bolsillo, y el agujero no para de crecer.\r\n\r\nEsta presentación se focaliza en las tres principales razones por las cuales el agujero está ahi… y creciendo. Estos son el ABC del Continuous Delivery:\r\n- Amplificación: Desplegar lleva más tiempo cuanto más tiempo tardas en desplegar\r\n- Bugs: Los Bugs son más costosos de arreglar cuanto más tiempo haga que se introdujeron\r\n- Cost of Delay (CoD): Cuanto menos frecuentes sean tus despliegues mas CoD\r\n\r\nEn el modelo que presentamos, se podrá apreciar que los costes de integración y despliegue son super lineales al numero de cambios a integrar. En el desarrollo de Software, los commits que no están en producción son inventario. Y el inventario es desperdicio.","notes":"Esta charla es una extensión al trabajo mostrado en una sesión de Pecha Kucha del Scrum Gathering de Praga 2015 delante de 600 personas.","audience_level":"Intermediate","tag_list":[],"rating":100.0},{"name":"Vicenç García-Altés","email":"vincentredrum@gmail.com","avatar":"https://secure.gravatar.com/avatar/3ef87a74fce147274d0cbb2b617c968e?s=500","location":"London","bio":"Desarrollador ágil con unos cuantos años de experiencia en la mochila. Centrado en C# pero con un ojo mirando a F# y Elm. Amante del trabajo bien hecho y de las conversaciones en un pub.","twitter":"vgaltes","url":"http://vgaltes.com","organization":"Valtech","shirt_size":"Men's L","title":"EventStorming: exploring your business domain","abstract":"EventStorming es un workshop pensado para descubrir de una forma rápida la mayor información posible de nuestro complejo dominio de negocio. De una manera colaborativa entre los diferentes interesados del producto iremos descubriendo el dominio a través de unas dinámicas.","description":"EventStorming es un workshop pensado para descubrir de una forma rápida la mayor información posible de nuestro complejo dominio de negocio. De una manera colaborativa entre los diferentes interesados del producto iremos descubriendo el dominio a través de unas dinámicas.\r\n\r\nCon la ayuda de unos post-its, unos rotuladores y mucha conversación, poco a poco iremos descubriendo más información del dominio y, como resultado final, habremos construido un lenguaje común a utilizar entre desarrolladores y gente de negocio. \r\n\r\nEl resultado final está perfectamente alineado con el estilo de implementación de DDD, particularmente con una aproximación utilizando Event Sourcing, y permite un rápido descubrimiento de las fronteras de nuestros Contextos y Agregados.\r\n\r\nY es muy divertido!","notes":"Si consigo ayuda podria montar un par de grupos de quince personas. Necesitaría dos paredes grandes donde colocar post-its (si están forradas de papel mejor), post-its de diferentes colores y rotuladores de diferentes colores.\r\n\r\nEl tiempo ideal son unas dos horas.","audience_level":"All","tag_list":["workshop","agile architecture","gamification","tools","product discovery"],"rating":100.0},{"name":"Matthew Philip","email":"matthewrphilip@gmail.com","avatar":"https://secure.gravatar.com/avatar/e1fd09bd25f2f9c4b6e827c3cd7ea25e?s=500","location":"Unknown","bio":"Matt Philip is the Director of Agile Coaching at Asynchrony Labs, a St. Louis, US-based information-technology consulting firm that specializes in in custom-application delivery. He has worked in software development as a coach, trainer, quality advocate and facilitator, helping organizations and teams become fit for their purpose. He is especially passionate about the Kanban method, continuous improvement and motivational design. He has spoken recently at XP2016, the Lean Kanban Executive Summit and London Lean Kanban Days.","twitter":"mattphilip","url":"https://mattphilip.wordpress.com/","organization":"Asynchrony Labs","shirt_size":"Men's M","title":"The NoEstimates Game","abstract":"If you wonder what NoEstimates is all about, attend this workshop session for a multi-team game that will help you:\n- Find out through experimentation what and how much different factors affect delivery time \n- Learn how to create a probabilistic forecast \n- Understand how to reduce variation\n\n","description":"Wondering what NoEstimates means in practice, or why you would want to use NoEstimates? Perhaps you’ve heard the buzz, read Vasco Duarte’s excellent book or simply want to understand how to plan better and reduce risk. If so, you should attend this workshop session for a multi-team game that will help you:\r\n\r\nFind out through experimentation what — and how much — different factors influence delivery time\r\nLearn how to create a probabilistic forecast that provides a less risky way to plan\r\nUnderstand how to reduce variation that affects — and creates risk in — delivery\r\nFor more information, including the game materials, please visit https://mattphilip.wordpress.com/2016/05/25/introducing-the-noestimates-game/","notes":"I will also give away copies of the game so that attendees can take them and play the game in their own organizations.\r\n\r\nTAGS\r\n====\r\ngame, project management, estimating, risk, forecasting, planning, noestimates, sources of variation","audience_level":"All","tag_list":[],"rating":100.0},{"name":"Dani Latorre","email":"danilat83@gmail.com","avatar":"https://secure.gravatar.com/avatar/36af729ef2005f18edc9b839f1eeb14b?s=500","location":"Zaragoza (Spain)","bio":"Llevo una docena de años dedicado al desarrollo de software. Ahora trabajo haciendo proyectos para terceros con varios amigos en Coding Stones y soy responsable de la parte técnica de OutreachTool; tras pasar por consultoras, mi propia startup y mucho tiempo como freelance y contractor. Además colaboro en comunidades locales como CachiruloValley o AgileAragón y he mentorizado a desarrolladores a través de Senpai Devs.","twitter":"dani_latorre","url":"http://codingstones.com/","organization":"CodingStones","shirt_size":"Men's XL","title":"No somos indies con flequillo (pero tenemos derecho a sonar en radio 3)","abstract":"Time to market es uno de esos anglicismos extendidos en el mundo empresarial. Una buena opción para acortar ese tiempo es contratar a un equipo indie que sepa lo que se hace para ayudar que la idea de negocio pase a ser un producto digital que se enfrente al mercado.","description":"Time to market es uno de esos anglicismos extendidos en el mundo empresarial. Una buena opción para acortar ese tiempo es contratar a un equipo *indie* que sepa lo que se hace para ayudar que la idea de negocio pase a ser un producto digital que se enfrente al mercado.\r\n\r\n¿A qué nos referimos cuando hablamos de equipos *indie*? Para nosotros son equipos pequeños, con una cultura compartida y que no pretenden escalar a nivel humano. Esto es, que consideran un valor mantenerse pequeños.\r\n\r\nNo es lo mismo personas que trabajan juntas que personas que trabajan en equipo. Así lo han entendido algunas compañías como Stripe, que anunciaron este año que empezaban a hacer recruiting de equipos completos. Aunque en realidad tampoco sea nada nuevo, llevamos años viendo operaciones de acqui-hiring entre compañías tecnológicas\r\n","notes":"","audience_level":"All","tag_list":[],"rating":100.0},{"name":"Néstor Salceda","email":"nestor.salceda@gmail.com","avatar":"https://secure.gravatar.com/avatar/e5ce4f558ae91861c783c3be311d6e34?s=500","location":"Zaragoza / Madrid","bio":"He desplegado más de 5.000 Dockers en producción. Y soy el único certificador de Scrot Master del mundo.","twitter":"nestorsalceda","url":"http://nestorsalceda.com","organization":"The Coding Stones","shirt_size":"Men's XL","title":"Devops: Desde la trincheras hasta los despachos","abstract":"El objetivo de esta charla es analizar una serie de prácticas de Devops, desde la voz de la experiencia, con un ojo puesto en los principios y valores Lean, uniendo este mundo con la economía del software. Y comprobaremos cómo esas buenas prácticas son rentables expresándolas en términos económicos.","description":"En esta charla vamos a recordar el problema de hacer una entrega de software, vamos a despiezarlo y a proponer unas prácticas que encajan en el ámbito de Devops. \r\n\r\nAnalizaremos esas prácticas desde el punto de vista de los principios de Lean Software Development:\r\n\r\n* Eliminar el desperdicio\r\n* Crear conocimiento\r\n* Decidir lo más tarde posible\r\n* Hacer la entrega lo más rápido posible\r\n* Hacer valioso al equipo\r\n* Calidad, sin errores\r\n* Optimizar el total\r\n\r\nY uniremos este análisis con la economía de desarrollo de software, nos pondremos el sombrero de economistas y hablaremos de riesgo, time to market, coste, valor o deuda para finalmente comprobar que son rentables si las vemos desde el punto de vista del dinero.\r\n\r\nTambién estudiaremos cómo la carencia de una determinada práctica afecta a nuestro negocio, ¿qué pasa si tenemos caído nuestro negocio durante una hora?¿Cuánto vale eso?","notes":"Esta charla la haremos entre dos personas: Javi Rubio y Néstor Salceda","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Mike Rötgers","email":"mike@roetgers.org","avatar":"https://secure.gravatar.com/avatar/ae8350f0b1d8bc83b48a04369f322369?s=500","location":"Berlin, Germany","bio":"I'm CTO \u0026 Co-Founder at OptioPay, a fintech startup located in Berlin. I started toying around with technology and software development while the dotcom bubble bursted in the early 2000s. In 2004 I decided to make a career out of it. With 18 I started my first e-commerce startup. It failed. :-) In 2009 I moved to Berlin and worked as a software developer, team lead and tech lead for a few companies. I was CTO at the Berlin-based startup Casacanda which was later acquired by Fab.com. In 2013 I co-founded Wunderdata, a business intelligence tech company with a strong e-commerce focus. After some time I moved on to start OptioPay, but the company and product is still alive and kicking.","twitter":"rtg","url":"","organization":"OptioPay GmbH","shirt_size":"Men's 2XL","title":"Story Of An Agile Transformation","abstract":"Back in the days I thought Agile consists of a few tools and a lot of buzzwords. Then we started an agile transformation at my company. You won't believe what happened next!","description":"Back in the days I thought: Agile is just good marketing. A few tools, a bunch of buzzwords, what's the big deal? In addition to that, I look at my past jobs as a software engineer and there was no Scrum, no Kanban, but it worked. Then I joined OptioPay, built up the IT department and for the first time it stopped working. We were growing as a company but I could feel things were going wrong, I could feel people being unhappy. But I did not possess the tools needed to fix it. As a consequence we brought in help from the outside and started an agile transformation in the beginning of 2016.\r\n\r\nI'd love to share our story. How we started, what steps we took when we moved to Scrum, the fears and doubts we had, the things we learned on the way, things that went completely wrong and of course all the amazing stuff that happened.","notes":"Hello organizers, I just wanted to drop a few sentences to explain my motivation for this talk: Personally, when I go to conferences, I love to hear \"war stories\". For IT conferences that means: Put an experienced developer with decent public speaking skills on stage and let him/her talk about a topic he/she knows well. Be it how it was to join SoundCloud as one of the first developers and how it all started, be it how the company recovered from a massive outage and what they learned from it or be it how the company adopted a microservice architecture and what happened to the organization and the codebase on that journey. It is entertaining and very often you can find yourself in those stories for example by remembering a past incident and learn what others did differently or for example by recognizing the same patterns or symptoms at your current workplace. I believe I can tell an interesting story about OptioPay and our agile transformation that is worth sharing.","audience_level":"All","tag_list":[],"rating":0.0},{"name":"Elle Waters","email":"elle@simplyaccessible.com","avatar":"https://secure.gravatar.com/avatar/ebb9d00e780ef0f6253495042b76ffd7?s=500","location":"Louisville, United States","bio":"Evangelizing the growth of Universal Design and lean accessibility as best practices within large organizations, Elle works on behalf of Simply Accessible with enterprise level clients to build the foundation needed to integrate accessibility into every facet of corporate culture. She's worked first hand with design, content, development, and testing teams to create agile, scalable methods to ensure more inclusive user experiences. She's seen amazing things happen, where the user's needs are the primary driver for change and innovation in large scale digital projects, where teams meet and even exceed their specific product goals, and where companies leap ahead of their competition, all by putting accessibility first. Elle has a passion for all things agile, a fascination with emerging technology, and a healthy fear of zombies.","twitter":"Nethermind","url":"http://www.simplyaccessible.com","organization":"Simply Accessible, Inc.","shirt_size":"Women's M","title":"Lean accessibility: Building inclusive design into your agile workflow","abstract":"Just as agile adoption can transform your company's culture, accessibility integration can serve as a catalyst for innovation and  maturity. Learn how agile and accessibility make excellent partners in building a lean, cost-effective practice of of user-centered, value-based design and development.","description":"Accessibility has a problem. When people talk about making their digital content accessible to people with disabilities, it sounds cumbersome, expensive, and anything but agile. The list of accessibility compliance requirements is somehow both exhaustive and frustratingly undefined. This creates problems for agile teams in measuring success, and it represents a guaranteed way to kill your project's velocity.\r\n\r\nAccessibility has a brand problem. Just as agile-minded thinking can transform your company's culture, accessibility integration can actually serve as a catalyst for innovation and continuous improvement within your agile process. Learn how agile and accessibility make excellent partners in building a lean, cost-effective practice of of user-centered, value-based design and development. From release planning to story writing, from estimation to testing, you'll leave equipped with the knowledge of how to successfully incorporate inclusive design at each level and for each role in your digital projects.\r\n","notes":"As Director of Strategy at Simply Accessible, I work closely with our enterprise Fortune 100 and Fortune 500 clients every day. My workshop submission proposes to teach people how to embrace both inclusive design and agile principles and radically transform their customers' online experience.  I'm eager to share this knowledge and these skills with conference attendees!","audience_level":"All","tag_list":[],"rating":100.0}]